Repository: C-Duv/fusioninventory.github.io
Catalog: documentation/agent/installation/macosx.*.po
Languages: fr

source: FusionInventory Agent installation on MacOS X
fr: Installation de l'agent FusionInventory pour MacOS X

source: Get the Agent
fr: Télécharger l'agent

source: First, get the agent mpkg archive [Intel](http://prebuilt.fusioninventory.org/stable/macosx-intel/) or [PowerPC](http://prebuilt.fusioninventory.org/stable/macosx-ppc/).
fr: En premier, sélectionner l'archive mpkg de l'agent correspondant à votre machine [Intel](http://prebuilt.fusioninventory.org/stable/macosx-intel/) ou [PowerPC](http://prebuilt.fusioninventory.org/stable/macosx-ppc/).

source: You must download the **.pkg.tar.gz** package.
fr: Vous devez télécharger le paquet **.pkg.tar.gz**.

source: Extract Agent
fr: Extraire l'agent

source: Once the FusionInventory-Agent-XXX.pkg.tar.gz archive is downloaded, you must extract it this way.
fr: Une fois l'archive FusionInventory-Agent-XXX.pkg.tar.gz téléchargée, vous devez l'extraire comme ça.

source: Do a right click on it to extract its content. You should now have two different file. Agent configuration
fr: Faites un clic droit sur le fichier compréssé pour l'extraire. Vous trouverez un fichier pkg.

source: To configure the agent, do a right clic on the FusionInventory-Agent.pkg package and select “Show the package content”".
fr: Pour configurer l'agent, faites un clic droit sur le fichier FusionInventory-Agent.pkg et sélectionnez «Afficher le contenu du paquet».

source: Go in the **Resources** directory and modify the **agent.cfg** file according to you needs:
fr: Allez dans le dossier **Resources** et modifiez le fichier **agent.cfg** selon vos besoins.

source: add the `server=` line
fr: Ajouter la ligne `server=`

source: you can also uncomment the `logfile = /var/log/fusioninventory.log` to get some log files
fr: Vous pouvez aussi décommenter la ligne `logfile = /var/log/fusioninventory.log` pour avoir les logs

source: Increase `backend-collect-timeout` value from `30` to `180` because the command used to get some hardware information can be very long
fr: Augmenter la valeur `backend-collect-timeout` de `30` à `180` parce que la commande utilisée pour obtenir les informations matériel peut être longue

source: Agent Installation
fr: Installation de l'agent

source: You're done. To launch the installer, just do a double clic on the FusionInventory-Agent.pkg and follow the different steps.
fr: Pour lancer l'installation, faites un double clic sur le fichier FusionInventory-Agent.pkg et suivez les différentes étapes.

source: The installer will ask for you login and password during the installation process.
fr: Durant l'installation, vous devrez taper votre login et mot de passe administrateur.

source: Once the agent is installed, you can configure it be editing the following file '/opt/fusioninventory-agent/agent.cfg'. You will have to restart the service after (see below);
fr: Une fois l'agent installé, vous pouvez le configurer en modifiant le fichier '/opt/fusioninventory-agent/agent.cfg'. Vous devrez redémarrer le service après (voir ci-dessous);

source: Command line installation
fr: Installation en ligne de commande

source: Retrieve the .pkg.tar.gz archive and do:
fr: Télécharger l'archive .pkg.tar.gz et faites:

source: You can either reboot or restart the service, see below.
fr: Vous pouvez soit redémarrer ou relancer le service, voir ci-dessous.

source: Manage the service
fr: Gérer le service

source: To see if the service is running:
fr: Pour voir si le service tourne:

source: The process is running with PID 266. If the process is stopped, you will get a line like this one:
fr: Le processus fonctionne avec le PID 266. Si le processus est arrêté, vous obtiendrez une ligne comme celle-ci:

source: To stop the service:
fr: Pour arrêter le service:

source: In some rare cases, this is not enough to stop the agent. You have to kill the process by yourself.
fr: Dans quelques rares cas, ce ne sera pas suffisant pour arrêter l'agent. Vous devez tuer le processus avec cette commande:

source: To start the service:
fr: Pour démarrer le service:

source: Force an inventory
fr: Forcer un inventaire

source: To force an inventory:
fr: Pour forcer un inventaire:
