Repository: C-Duv/fusioninventory.github.io
Catalog: documentation/agent/installation/solaris.*.po
Languages: fr

source: System-specific informations
fr: Informations spécifiques du Sytème

source: You may need to install some [[system specific dependencies|documentation/agent/system_dep]].
fr: Vous devez installer plusieurs [[dépendances spécifiques au système|documentation/agent/system_dep]].

source: Installation on Solaris
fr: Installation sur Solaris

source: OpenCSW package
fr: Paquet OpenCSW

source: A package is available on [OpenCSW](http://www.opencsw.org/packages/fusioninventory_agent/) repository. http://www.opencsw.org/packages/fusioninventory_agent/
fr: Un paquet est disponible sur le dépôt [OpenCSW](http://www.opencsw.org/packages/fusioninventory_agent/) http://www.opencsw.org/packages/fusioninventory_agent/

source: [OpenCSW package installation documentation](http://www.opencsw.org/manual/for-administrators/getting-started.html).
fr: [Documentation sur l'installation des paquets OpenCSW](http://www.opencsw.org/manual/for-administrators/getting-started.html).

source: Installation from source
fr: Installation depuis les sources

source: [[Installation from source|documentation/agent/installation/source]].
fr: [[Installation depuis les sources|documentation/agent/installation/source]].

source: Prebuilt package
fr: Paquet Prebuilt

source: Even if it's not the recommended installation method, sometime it's helpful to be able to run an inventory without system modification. In this case, you can use the [[prebuilt packages|documentation/agent/installation/prebuilt]].
fr: Même si ce n'est pas la méthode d'installation recommandée, parfois il est utile d'être en mesure d'exécuter un inventaire sans modification du système. Dans ce cas, vous pouvez utiliser le [[paquet prebuilt|documentation/agent/installation/prebuilt]].
