Repository: C-Duv/fusioninventory.github.io
Catalog: documentation/agent/installation/source.*.po
Languages: fr

source: Installation from the source tarball
fr: Installation depuis les sources

source: Get the sources Luke!
fr: Trouves la source, Luke!

source: You can download the last official release from [the forge](http://forge.fusioninventory.org/projects/fusioninventory-agent/files) or directly from [the CPAN](https://metacpan.org/release/FusionInventory-Agent).
fr: Vous pouvez télécharger la dernière version officielle stable par [the forge](http://forge.fusioninventory.org/projects/fusioninventory-agent/files) ou directement par [the CPAN](https://metacpan.org/release/FusionInventory-Agent).

source: Tarball with a **rc** or **beta** version suffix are developpement release not ready for production.
fr: Les archives avec les suffixes **rc** ou **beta** dans la version ne sont pas destinées à être mises en production.

source: It's also possible to get snapshot from Github:
fr: Il est aussi possible de récupérer une image par Github:

source: agent from sources
fr: Agent depuis les sources

source: We strongly recommand the use of __GNU tar__ because some file path lenght are greater than 100 caracters. Some tar version will silently ignore those files like for example on HP-UX.
fr: Nous vous recommandons fortement d'utiliser GNU tar, parce que plusieurs chemins de fichier sont long de plus de 100 caractères. D'autres version de tar risque d'ignorer ces fichiers comme par exemple sur HP-UX.

source: First, you need to extract the source and run the Makefile.PL
fr: Dans un premier temps, vous devez extraire les sources et lancer le fichier Makefile.PL

source: Makefile.PL will ensure all the required dependencies are available and prepare the build tree.
fr: Makefile.PL vérifiera que toutes les dépendances soient satisfaites et préparera l'organisation de construction.

source: At this point, you will probably have some missing required modules. The best tool to resolve the situation is [cpanm](https://raw.github.com/miyagawa/cpanminus/master/cpanm). Just run:
fr: A ce niveau, vous aurez probablement plusieurs modules requis absents. Le meilleur outil pour résoudre cette situation est [cpanm](https://raw.github.com/miyagawa/cpanminus/master/cpanm). Lancez :

source: You can use the _--notest_ flag if you are brave and want to skip the test-suite execution.
fr: Vous pouvez utiliser l'option _--notest_ si vous aimez le risque et pour sauter le test-suite execution.

source: You may also need to install some [[system specific dependencies|documentation/agent/system_dep]].
fr: Vous devrez aussi installer d'autres [[dépendances spécifiques à votre système|documentation/agent/system_dep]].

source: Once this is done, run once again:
fr: Une fois que cela sera fait, lancez une nouvelle fois:

source: This time the execution should success and you can finish the installation. Here again we recommand GNU make (gmake):
fr: Cette fois l'exécution doit être un succès et vous pouvez terminer l'installation. Nous vous recommandons également GNU make (gmake):

source: Change the installation directory
fr: Changer le dossier d'installation

source: If you don't want to use the default directory (/usr/local), you can use the PREFIX parameter during the Makefile.PL step:
fr: Si vous ne voulez pas utiliser le dossier par défaut (/usr/local), vous pouvez utiliser l'option PREFIX pendant l'utilisation de Makefile.PL:

source: plugins installation from source
fr: Installation des plugins depuis les sources

source: The plugin installation follow the same process:
fr: L'installation des plugins suit le même procédé:

source: Agent will read it's configuration from /etc/fusioninventory/agent.cfg. You need at least a `server` line:
fr: L'agent trouve sa configuration dans le fichier /etc/fusioninventory/agent.cfg. Vous devez au moins paramétrer la ligne `server` :

source: You can use the [crontab](http://en.wikipedia.org/wiki/Cron) to launch the agent. The agent will need a correctly initialized $PATH environment variable.
fr: Vous pouvez utiliser la [crontab](http://en.wikipedia.org/wiki/Cron) pour lancer l'agent. Il a besoin d'être correctement initialisé pour la variable d'environnement $PATH.

source: This is an example of an /etc/crontab entry:
fr: Voici un exemple de paramètre pour /etc/crontab:

source: SSL communication are based on [IO::Socket::SSL](https://metacpan.org/module/IO::Socket::SSL). You build it you will need openssl header files and a C compiler.
fr: La communication par SSL est basée sur [IO::Socket::SSL](https://metacpan.org/module/IO::Socket::SSL). Pour l'activer, vous devez avoir les fichiers *openssl header* et un compilateur *C*.

source: If you don't want to use SSL, you can avoid keep this dependency uninstalled. The agent will disable SSL by itself.
fr: Si vous n'avez pas besoin de SSL, vous pouvez vous passer de ces dépendances inactivées. L'agent désactivera tout seul SSL.

source: FusionInventory components come with a test-suite. You can run it after the `perl Makefile.PL` with this command:
fr: FusionInventory possède un *test-suite*. Vous pouvez le lancer après `perl Makefile.PL` avec cette commande:

source: The test-suites require some additional dependencies like Test::More.
fr: Les *test-suites* requirent plusieurs dépendances comme Test::More.
