Repository: C-Duv/fusioninventory.github.io
Catalog: documentation/agent/installation/windows.*.po
Languages: es, fr

source: Microsoft Windows Installation
es: Instalación en Microsoft Windows
fr: Installation pour Microsoft Windows

source: [[!template id=warning text="The new FusionInventory Agent 2.3.x comes with a **new** Microsoft Windows installer. The documentation you have below is regarding this new installer. If you are looking for documentation about FusionInventory Agent 2.2.x (and previous) and its installer, you find it [[here|documentation/agent/installation/windows_before_2.3.0]]."]]
es: [[!template id=warning text="El nuevo FusionInventory Agent 2.3.x viene con un **nuevo** instalador para Microsoft Windows. La documentación que tiene más abajo está relacionada con este nuevo instalador. Si está buscando documentación referente a FusionInventory Agent 2.2.x (y anteriores) y su instalador, la encontrará [[aquí|documentation/agent/installation/windows_before_2.3.0]]."]]
fr: [[!template id=warning text="Le nouvel Agent FusionInventory 2.3.x est livré avec un nouveau installeur Microsoft Windows. La documentation ci-dessous est faite pour cette nouvelle version. Si vous recherchez la documentation pour l'Agent FusionInventory 2.2.x (et antérieur) et son installation, vous trouverez cela [[ici|documentation/agent/installation/windows_before_2.3.0]]."]]

source: Get the Installer
es: Obtener el Instalador
fr: Trouvez l'Installeur

source: You can get the last FusionInventory Agent installer for Microsoft Windows [here](http://forge.fusioninventory.org/projects/fusioninventory-agent-windows-installer/files "http://forge.fusioninventory.org/projects/fusioninventory-agent-windows-installer/files"). The file name of the installer follows this pattern:
es: Puede obtner el último instalador de FusionInventory Agent para Microsoft Windows [aquí](http://forge.fusioninventory.org/projects/fusioninventory-agent-windows-installer/files "http://forge.fusioninventory.org/projects/fusioninventory-agent-windows-installer/files"). El nombre del fichero del instalador sigue el siguente patrón:
fr: Vous pouvez avoir le dernier Installeur de l'Agent FusionInventory pour Microsoft Windows [ici](http://forge.fusioninventory.org/projects/fusioninventory-agent-windows-installer/files "http://forge.fusioninventory.org/projects/fusioninventory-agent-windows-installer/files"). Le nom du fichier de l'Installeur suit cette notation:

source: Some notes about the new FusionInventory Agent installer for Microsoft Windows.
es: Algunas notas sobre el nuevo instalador de FusionInventory Agent para Microsoft Windows.
fr: Quelques notes à propos du nouvel Installeur de l'Agent FusionInventory pour Microsoft Windows:

source: The installer for each *\<platform>*, integrates its native, although reduced, version of [Strawberry Perl](http://strawberryperl.com/ "http://strawberryperl.com/") 5.16.3.1.
es: El instalador para cada *\<platform>*, integra su nativa, aunque reducida, versión de [Strawberry Perl](http://strawberryperl.com/ "http://strawberryperl.com/") 5.16.3.1.
fr: L'installeur pour chaque *\<platform>*(plate-forme), intègre nativement, en mode réduit, la version [Strawberry Perl](http://strawberryperl.com/ "http://strawberryperl.com/") 5.16.3.1.

source: Inside the *\<version>*, *\<package>* is optional and indicates the secuence of the installer for FusionInventory Agent *\<manor>*.*\<minor>*.*\<release>*. A new *\<package>* may contain improvements regarding the installer itself, the agent (patches) or both.
es: Dentro de *\<version>*, *\<package>* es opcional e indica la secuencia del instalador para FusionInventory Agent *\<manor>*.*\<minor>*.*\<release>*. Un nuevo *\<package>* puede contener mejoras relecionadas con el propio instalador, con el agente (parches) o con ambos.
fr: Les valeurs correspondant à *\<version>*(numéro de version), option et indication du numéro de *\<package>*(paquet) en fonction de valeur *\<manor>*(majeur).*\<minor>*(mineur).*\<release>* définissant la version de l'Agent FusionInventory. Un nouveau *\<package>* peut contenir des modifications de l'installeur lui-même, l'Agent (correctifs) ou les deux.

source: It's possible to install *fusioninventory-agent_windows_x86_\<version>.exe* on a 32-bit or 64-bit Microsoft Windows system but only is possible to install *fusioninventory-agent_windows_x64_\<version>.exe* on a 64-bit Microsoft Windows system.
es: Es posible instalar *fusioninventory-agent_windows_x86_\<version>.exe* en un sistema Microsoft Windows de 32-bit o de 64-bit pero solo es posible instalar *fusioninventory-agent_windows_x64_\<version>.exe* en un sistema Microsoft Windows de 64-bit.
fr: Il est possible d'installer *fusioninventory-agent_windows_x86_\<version>.exe* sur un système Windows 32-bit ou 64-bit mais on ne peut installer la version *fusioninventory-agent_windows_x64_\<version>.exe* que sur un système 64-bit.

source: The Installer Manual
es: El Manual del Instalador
fr: Installation manuelle

source: You can find the manual of the FusionInventory Agent installer for Microsoft Windows [[here|documentation/agent/installation/windows/windows-installer-2.3.x-command-line]].
es: Puede encontrar el manual del instalador de FusionInventory Agent para Microsoft Windows [[aquí|documentation/agent/installation/windows/windows-installer-2.3.x-command-line]].
fr: Vous trouverez le manuel de l'installation de l'Agent FusionInventory pour Microsoft Windows [[sur cette page|documentation/agent/installation/windows/windows-installer-2.3.x-command-line_fr]].

source: The manual is self-contained in the own installer. You can get it of one of the following ways:
es: El manual está auto-contenido en el propio instalador. Puede obtenerlo de uno de los siguientes modos:
fr: Le manuel est intégré dans l'installeur. Vous pouvez l'afficher selon les méthodes suivantes:

source: [[!template id=info text="It's recommended read this documentation completely each time a new version is released; the new FusionInventory Agent installer for Microsoft Windows is still young and it's in a constant process of improvement, including its manual."]]
es: [[!template id=info text="Se recomienda leer esta documentación completamente cada vez que es liberada una nueva versión; el nuevo instalador de FusionInventory Agent para Microsoft Windows es aun joven y está en constante proceso de mejora, incluido su manual."]]
fr: [[!template id=info text="Il est recommandé de lire la documentation complètement à chaque nouvelle version majeur; Le nouvel installeur de l'Agent FusionInventory est récent et il est en constante évolution, inclu le manuel."]]

source: Installation from Command Line and Silent Installation
es: Instalación desde la Línea de Comandos e Instalación Silenciosa
fr: Installation en ligne de commande et Installation silencieuse

source: The FusionInventory Agent installer for Microsoft Windows performs a *visual mode* installation unless it's specified the ***/S*** option in the command line, in whose case it performs a *silent mode* installation.
es: El instalador de FusionInventory Agent para Microsoft Windows realiza una instalación en *modo visual* a menos que sea especificada la opción ***/S*** en la línea de comandos, en cuyo caso realiza una instalación en *modo silencioso*.
fr: L'installeur de l'Agent FusionInventory pour Microsoft Windows est prévu pour être lancer en mode graphique sauf si l'option ***/S*** est utilisée en ligne de commande permettant ainsi l'installation en mode silencieuse.

source: For more information about the use of the command line, please, see ***The Installer Manual*** section above.
es: Para más información acerca del uso de la línea de comandos, por favor, vea la sección ***El Manual del Instalador*** más arriba.
fr: Pour plus d'information sur l'utilisation de la ligne de commande, reportez vous au ***Manuel d'installation*** cité ci-dessus.

source: Visual Installation
es: Instalación Visual
fr: Installation en mode graphique

source: As it said above, unless it's specified the ***/S*** option in the command line, the FusionInventory Agent installer for Microsoft Windows performs a *visual mode* installation. The easy way of performs a *visual mode* installation is doing double click on the *fusioninventory-agent_windows-\<platform>_\<version>.exe* program.
es: Como se dijo anteriormente, a menos que sea especificada la opción ***/S*** en la línea de comandos, el instalador de FusionInventory Agent para Microsoft Windows realiza una instalación en *modo visual*. El modo mas sencillo de realizar una instalación en *modo visual* es haciendo doble *click* sobre el programa *fusioninventory-agent_windows-\<platform>_\<version>.exe*.
fr: Comme il est dit ci-dessus, à moins qu'il soit spécifié l'option /S dans la ligne de commande, l'installation de l'agent FusionInventory pour Microsoft Windows s'effectuera en mode graphique. Le moyen le plus facile pour ce type d'installation est de faire un double-clic sur l'exécutable *fusioninventory-agent_windows-\<platform>_\<version>.exe*

source: The fields and controls that appear in the *visual mode* installation are intimately related with the command line options. That's the reason because it's recommended to read ***The Installer Manual*** section (*see above*) before to perform any installation.
es: Los campos y controles que aparecen en la instalación en *modo visual* están intimamente relacionados con las opciones de la línea de comandos. Esta es la razón por la que se recomienda leer la sección ***El Manual del Instalador*** (*ver más arriba*) antes de realizar cualquier instalación.
fr: Les champs et les contrôles qui apparaissent dans l'installation en mode graphique sont les mêmes que les options de ligne de commande. C'est pour cette raison qu'il est recommandé de lire la section du manuel d'installation (voir ci-dessus) avant d'effectuer toute installation.

source: For more information about the *visual mode* installation, please, see the following gallery of [[commented screenshots of FusionInventory Agent installer for Microsoft Windows|documentation/agent/installation/windows/windows-installer-2.3.x-visual-mode]]. (*still under construction*)
fr: Pour plus d'information sur l'installation en mode graphique, veuillez vous reporter à la page dédiée pour [[installation de l'agent FusionInventory pour Microsoft Windows|documentation/agent/installation/windows/windows-installer-2.3.x-visual-mode]].

source: Large Installations
es: Grandes Instalaciones
fr: Installation en masse

source: There's a page dedicated to explain [[how to deploy FusionInventory Agent 2.2.x (and previous) on a Windows Domain|documentation/agent/installation/windows/large_install]] but, at the moment, its instructions are not valid for the new FusionInventory Agent installer.
fr: Une page explique la manière de [[déployer l'Agent FusionInventory 2.2.x (et antérieur) dans un domaine Windows|documentation/agent/installation/windows/large_install]] mais actuellement, cette procédure est incompatible avec le nouvel installeur de l'Agent FusionInventory.

source: Nowadays, and while a new page is written with more detail about its use, it's available from here the new VBScript (Visual Basic Script) with name *fusioninventory-agent-deployment.vbs* that allows to perform an unattended deployment of *fusioninventory-agent_windows-\<platform>_\<version>.exe* in large (and in not so large) environments. You can find its last version [here](https://raw.github.com/fusinv/fusioninventory-agent/2.3.x/contrib/windows/fusioninventory-agent-deployment.vbs "https://raw.github.com/fusinv/fusioninventory-agent/2.3.x/contrib/windows/fusioninventory-agent-deployment.vbs").
fr: Pour le nouvel agent, il y a maintenant un nouveau script VBS (Visual Basic Script) étant nommé *fusioninventory-agent-deployment.vbs* qui permet de déployer en masse l'agent *fusioninventory-agent_windows-\<platform>_\<version>.exe* et vous trouverez la dernière version [ici](https://raw.github.com/fusinv/fusioninventory-agent/2.3.x/contrib/windows/fusioninventory-agent-deployment.vbs).

source: Installation from Sources
fr: Installation via les sources

source: If you are a developer, or an advanced user, you can also install FusionInventory Agent 2.3.x [[from sources|documentation/agent/dev/git_windows]].
fr: Si vous êtes développeur ou un utilisateur expérimenté, vous pouvez aussi installer l'Agent FusionInventory [[via les sources|documentation/agent/dev/git_windows]].
