Repository: C-Duv/fusioninventory.github.io
Catalog: news/2013/08/01/FusionInventory-Agent-2.3.0.*.po
Languages: fr

source: Hello FusionInventory users,
fr: Bonjour les usagers de FusionInventory,

source: The FusionInventory Agent maintainers are glad to announce the 2.3.0 release.
fr: Les développeurs du FusionInventory Agent sont heureux d'annoncer la sortie de la version 2.3.0.

source: You can download the archive from [the forge](http://forge.fusioninventory.org/attachments/download/1016/FusionInventory-Agent-2.3.0.tar.gz) or directly from [the CPAN](https://metacpan.org/release/FusionInventory-Agent)
fr: Vous pouvez télécharger l'archive depuis [la Forge](http://forge.fusioninventory.org/attachments/download/1016/FusionInventory-Agent-2.3.0.tar.gz) ou directement via [CPAN](https://metacpan.org/release/FusionInventory-Agent).

source: We want to thank all the people involved during the developement process.
fr: Nous remercions toutes les personnes qui se sont investies dans le processus de développement.

source: Packages
fr: Paquets

source: Windows packages are available on [the forge](http://forge.fusioninventory.org/projects/fusioninventory-agent-windows-installer/files). The new installer is now maintained by Tomás Abad. The parameters are different take some minutes to read the documentation.
fr: Les paquets pour Windows sont disponibles sur [la Forge](http://forge.fusioninventory.org/projects/fusioninventory-agent-windows-installer/files). Le nouvel installeur est maintenant maintenu par Tomás Abad. Les paramètres peuvent être modifiés, prenez quelques minutes pour lire la documentation.

source: The previous 2.2.x Windows packages are [still available](http://prebuilt.fusioninventory.org/stable/windows-i386/).
fr: Les paquets des versions 2.2.x pour Windows sont toujours [disponibles](http://prebuilt.fusioninventory.org/stable/windows-i386/).

source: The other packages, especially MacOSX, will be published soon.
fr: Les autres paquets, spécialement pour MacOSX, seront publiés prochainement.

source: This release changelog
fr: Journal des modifications de cette version :

source: This is a major release that include various important changes.
fr: C'est une mise à jour majeur qui inclut plusieurs changements importants

source: Deploy, Network and ESX tasks are now integrated in the distribution
fr: Les tâches de Télédéploiement, Réseau et ESX sont maintenant incluses dans la distribution

source: new fusioninventory-inventory executable, dedicated to inventory task
fr: Un nouvel exécutable de fusioninventory-inventory, dédié au tâche d'inventaire

source: no more thread usage for HTTP interface
fr: Moins de thread pour l'interface HTTP

source: no more token usage for HTTP interface, request source address is enough
fr: Moins de token pour l'interface HTTP, la requête de l'adresse source est suffissante

source: `--httpd-trust` option now allows multiple values
fr: Option --httpd-trust peut avoir plusieurs valeurs

source: `--daemon and` `--no-fork` options are now available from command-line only
fr: Options --daemon et --no-fork sont utilisables uniquement depuis la console de commande

source: inventory task:
fr: Tâche d'inventaire :

source: add DNS_DOMAIN, BOOT_TIME and FQDN in OPERATINGSYSTEM section ([[!bug 1197]], [[!bug 1347]], [[!bug 1358]])
fr: Ajout de DNS_DOMAIN, BOOT_TIME et FQDN dans la section OPERATINGSYSTEM ([[!bug 1197]], [[!bug 1347]], [[!bug 1358]])

source: collect public SSH keys
fr: Inventaire clés publiques SSH

source: collect local users and groups ([[!bug 1570]], [[!bug 1870]])
fr: Inventaire des utilisateurs et groupes locaux ([[!bug 1570]], [[!bug 1870]])

source: collect license key for MS Office on Windows ([[!bug 152]])
fr: Inventaire des licences pour MS Office sur Windows ([[!bug 152]])

source: collect software from user profile on Windows([[!bug 1674]])
fr: Inventaire des logiciels installés dans le profil utilisateur sur Windows ([[!bug 1674]])

source: collect license key for Adobe suite, Panic's Transit, VMware Fusion on MacOs
fr: Inventaire des licences pour Adobe suite, Panic's Transit, VMware Fusion sur MacOSX

source: collect service package version on AIX ([[!bug 1896]])
fr: Inventaire des versions de paquets de service sur AIX ([[!bug 1896]])

source: collect manufacturer information for memories ([[!bug 1735]])
fr: Inventaire des informations du fabricant de la mémoire ([[!bug 1735]])

source: enforce consistent handling of USB and PCI identifiers ([[!bug 1861]])
fr: Exécuter une reconnaissance correcte des identifiants des USB et PCI ([[!bug 1861]])

source: enforce consistent TYPE values for network interfaces ([[!bug 1838]])
fr: Respecter une cohérence des valeurs TYPE pour les interfaces réseaux ([[!bug 1838]])

source: various UTF8 encoding fixes
fr: Correction de l'encodage UTF8

source: better stripping of bogus values
fr: Une meilleure récupération des codes d'erreurs

source: Megaraid and 3ware RAID controller support on BSD (Egor Morozov)
fr: Support de Megaraid et 3ware RAID controller sur BSD (Egor Morozov)

source: Megaraid controller support on Linux (Egor Morozov)
fr: Support de Megaraid controller sur Linux (Egor Morozov)

source: support new OpenVZ configuration on Linux (Alessandro Iurlano)
fr: Support de la nouvelle configuration d'OpenVZ pour Linux (Alessandro Iurlano)

source: LPAR support on AIX ([[!bug 950]], [[!bug 952]])
fr: Support de LPAR pour AIX ([[!bug 950]], [[!bug 952]])

source: FreeBSD jail support on BSD ([[!bug 736]], [[!bug 1555]])
fr: Support de FreeBSD jail pour BSD ([[!bug 736]], [[!bug 1555]])

source: better caching of system_profiler output ([[!bug 2076]])
fr: Une meilleure mise en cache de la sortie system_profiler ([[!bug 2076]])

source: better Qemu support ([[!bug 2106]])
fr: Un meilleur support de Qemu ([[!bug 2106]])

source: better OpenVM support ([[!bug 1774]])
fr: Un meilleur support d'OpenVM ([[!bug 1774]])

source: better HyperV support ([[!bug 1989]], [[!bug 1990]], [[!bug 1991]])
fr: Un meilleur support de HyperV ([[!bug 1989]], [[!bug 1990]], [[!bug 1991]])

source: fix CPU inventory for non-i386 arches on Linux ([[!bug 2172]])
fr: Correction de l'inventaire CPU pour les architectures non-i386 pour Linux ([[!bug 2172]])

source: better CPU inventory on Solaris ([[!bug 1741]], [[!bug 1905]], [[!bug 2152]])
fr: Un meilleur inventaire CPU pour Solaris ([[!bug 1741]], [[!bug 1905]], [[!bug 2152]])

source: better memory inventory on Solaris ([[!bug 1711]], [[!bug 1714]], [[!bug 1737]])
fr: Un meilleur inventaire mémoire pour Solaris ([[!bug 1711]], [[!bug 1714]], [[!bug 1737]])

source: better slot inventory on Solaris ([[!bug 1730]])
fr: Un meilleur inventaire des Slot pour Solaris ([[!bug 1730]])

source: fix VXFS filesystem identification on Solaris ([[!bug 1696]])
fr: Correction de l'identification du système de fichier VXFS pour Solaris ([[!bug 1696]])

source: minimal support for busybox-specific command output ([[!bug 1372]])
fr: Support minimal pour les sorties de commande spécifique de Busybox ([[!bug 1372]])

source: no more memconf usage on Solaris
fr: Moins d'usage de memconf pour Solaris

source: no more Mac::SysProfile usage on MacOS ([[!bug 1646]])
fr: Moins d'usage de Mac::SysProfile pour MacOSX ([[!bug 1646]])

source: wake-on-lan task:
fr: Tâche wake-on-lan :

source: ethernet and udp methods support on all systems
fr: Support des méthodes ethernet et UDP sur tous les systèmes

source: netdiscovery task:
fr: Tâche découverte réseau :

source: fix for regression introduced during code refactoring regarding printers identification
fr: Correction de la régression introduite dans la reconstruction du code concernant l'identification des imprimantes

source: check the link for 404 error in the doc
fr: Vérification du lien pour l'erreur 404 dans la doc

source: check for warnings generated during parsing
fr: Vérification pour les alertes générées pendant l'analyse

source: check entries generated from parsing match expected inventory format
fr: Vérification des entrées générées depuis les résultats d'analyse prévus dans le format d'inventaire

source: normalize list before comparaison, for perl 5.18 hash randomisation
fr: Mise en forme de la liste avant comparaison, pour Perl 5.18 hachage aléatoire

source: We did our best to provide a solid release, please [[contact us|/resources]] is you believe you find something unexpected.
fr: Nous avons fait notre possible pour fournir une version fiable, SVP [[contactez nous|/resources]] si vous pensez avoir trouver quelque chose d'inattendue.
