Repository: C-Duv/fusioninventory.github.io
Catalog: documentation/agent/installation/windows/large_install.*.po
Languages: fr

source: Silent installation
fr: Installation silencieuse

source: [[fusioninventory.vbs|documentation/agent/installation/windows/fusioninventory.vbs]] is a VBS script used to:
fr: [[fusioninventory.vbs|documentation/agent/installation/windows/fusioninventory.vbs]] est un script à utiliser comme suis:

source: Download the fusioninventory Windows installer
fr: Téléchargez l'installeur de FusionInventory pour Windows

source: Remove OCS Inventory Agent
fr: Enlevez l'agent OCS Inventory

source: Install or upgrade FusionInventory
fr: Installer ou mettez à jour FusionInventory

source: To use this script, you must first download the script and then edit it. The first lines of the script must be adjusted for your configuration:
fr: Pour utiliser ce script, vous devez en premier le télécharger, puis l'éditer. Les premières lignes de ce script doivent être modifiées pour votre configuration:

source: versionverification: the version of fusioninventory to install
fr: versionverification: Version de FusionInventory à installer

source: fusionarguments: the command line argument for the [[Windows installer|documentation/agent/installation/windows]])
fr: fusionarguments: Options en ligne de commande pour le [[Windows installer|documentation/agent/installation/windows]])

source: fusionsetupURL: the location of the Windows installer binary (either HTTP or Windows share)
fr: fusionsetupURL: Emplacement de l'installeur pour Windows (soit HTTP ou partage Windows)

source: uninstallocsagent: "yes" if OCS Agent has to be removed
fr: uninstallocsagent: "yes" si l'agent OCS doit être enlevé

source: You can use this script to:
fr: Vous pouvez utiliser ce script pour:

source: run a silent installation on a given machine
fr: Lancer une installation silencieuse sur une machine ciblée

source: deploy the agent on your network using psexec
fr: Déployer l'agent sur votre parc via psexec

source: prepare a GPO to deploy the agent on all the machines of the Windows domain
fr: Préparer une GPO pour déployer l'agent sur toutes les machines du domaine Windows

source: Just double clic on the script or run from a command console:
fr: Double-cliquez simplement sur le script ou lancer la commande:

source: To run the fusioninventory.vbs script on a machine computer1
fr: Pour lancer le script fusioninventory.vbs sur une machine computer1

source: Or if you want to run the install on all the computer of your domain:
fr: Ou si vous voulez lancer l'installation sur tous les machines de votre domaine:

source: Create a GPO and copy the script within and associate the fusioninventory.vbs script. The GPO has to be configured to run during machine start up.
fr: Créer une GPO et copier le script dedans et associer le script fusioninventory.vbs. La GPO est configurée pour s'exécuter au démarrage de la machine.

source: You may be interested by these two GPO templates:
fr: Vous serez peut être intéressés par deux templates GPO:

source: Alternative VBS script
fr: Autres scripts VBS

source: An [[alternative script|documentation/agent/installation/windows/fusioninventory-alternative.vbs]] maintained by ZenAdm also exists.
fr: Un [[script alternatif|documentation/agent/installation/windows/fusioninventory-alternative.vbs]] maintenu par ZenAdm est aussi disponible.

source: This script is still *experimental* but it is already much easier to understand.
fr: Ce script est *experimental* mais il est plus facile à comprendre.
