Repository: C-Duv/fusioninventory.github.io
Catalog: documentation/agent/installation/windows/windows-installer-2.3.x-visual-mode.*.po
Languages: fr

source: FusionInventory Agent Installer for Microsoft Windows -- Interactive Installation
fr: Installeur de l'Agent FusionInventory pour MS Windows -- Installation Interactive

source: Installer Language Screen
fr: Écran sélection de la langue

source: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-001-installer-language.png alt="Installer Language"]]
fr: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-001-installer-language_fr.png alt="Installer Language"]]

source: Welcome Screen
fr: Écran de bienvenue

source: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-002-welcome.png alt="Welcome"]]
fr: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-002-welcome_fr.png alt="Welcome"]]

source: License Agreement Screen
fr: Écran de validation de la Licence

source: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-003-license-agreement.png alt="License Agreement"]]
fr: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-003-license-agreement_fr.png alt="License Agreement"]]

source: Installation Type Screen
fr: Écran de sélection du type d'Installation

source: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-004-installation-type.png alt="Installation Type"]]
fr: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-004-installation-type_fr.png alt="Installation Type"]]

source: Components Screen
fr: Écran de sélection des composants à installer

source: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-005-choose-components.png alt="Components"]]
fr: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-005-choose-components_fr.png alt="Components"]]

source: Install Location Screen
fr: Écran du choix du dossier d'installation

source: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-006-install-location.png alt="Install Location"]]
fr: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-006-install-location_fr.png alt="Install Location"]]

source: Targets Screen
fr: Écran de localisation de l'inventaire, local ou distant

source: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-007-choose-targets.png alt="Targets"]]
fr: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-007-choose-targets_fr.png alt="Targets"]]

source: Remote Target Option Screens
fr: Écrans de sélection des options pour envoyer l'inventaire au serveur distant

source: Remote Target Options Screen (1/2)
fr: Écran des options SSL du serveur (1/2)

source: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-008-remote-targets-options-1.png alt="Remote Targets Options (1/2)"]]
fr: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-008-remote-targets-options-1_fr.png alt="Remote Targets Options (1/2)"]]

source: Remote Target Options Screen (2/2)
fr: Écran des options pour utiliser un proxy (2/2)

source: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-009-remote-targets-options-2.png alt="Remote Targets Options (2/2)"]]
fr: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-009-remote-targets-options-2_fr.png alt="Remote Targets Options (2/2)"]]

source: Execution Mode Screen
fr: Écran pour choisir le mode d'exécution de l'agent

source: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-010-execution-mode.png alt="Execution Mode"]]
fr: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-010-execution-mode_fr.png alt="Execution Mode"]]

source: As a Windows Service Screens
fr: Écran d'option pour le mode Service

source: HTTP Server Options Screen
fr: Écran pour les options du serveur HTTP

source: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-011-http-server-options.png alt="HTTP Server Options"]]
fr: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-011-http-server-options_fr.png alt="HTTP Server Options"]]

source: As a Windows Task Screens
fr: Écran d'option pour le mode gestionnaire de tâche

source: Windows Task Options Screen
fr: Écran lancement Tâche Windows

source: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-012-windows-task-options.png alt="Windows Task Options"]]
fr: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-012-windows-task-options_fr.png alt="Windows Task Options"]]

source: Miscelaneous Options Screen
fr: Écran pour les options complémentaires

source: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-013-miscelaneous-options.png alt="Miscelaneous Options"]]
fr: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-013-miscelaneous-options_fr.png alt="Miscelaneous Options"]]

source: Advanced Options Screen
fr: Écran pour les options avancées

source: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-014-advanced-options.png alt="Advanced Options"]]
fr: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-014-advanced-options_fr.png alt="Advanced Options"]]

source: Debug Options Screen
fr: Écran des options de Debug

source: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-015-debug-options.png alt="Debug Options"]]
fr: [!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-015-debug-options_fr.png alt="Debug Options"]]

source: Installing Screen
fr: Écran d'installation en cours

source: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-016-installing.png alt="Installing"]]
fr: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-016-installing_fr.png alt="Installing"]]

source: Installation Complete Screen
fr: Écran Installation complète

source: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-017-installation-complete.png alt="Installation Complete"]]
fr: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-017-installation-complete_fr.png alt="Installation Complete"]]

source: Completing Screen
fr: Écran de fin

source: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-018-completing.png alt="Completing"]]
fr: [[!img documentation/agent/installation/windows/windows-installer-2.3.x-screen-018-completing_fr.png alt="Completing"]]
