Repository: C-Duv/fusioninventory.github.io
Catalog: news/2013/07/12/FusionInventory_for_GLPI_0.83_2.3.*.po
Languages: fr

source: [[!meta title="Plugin FusionInventory for GLPI 0.83+2.3 is available (maintenance version)"]]
fr: [[!meta title="Plugin FusionInventory for GLPI 0.83+2.3 est disponible (version de maintenance)"]]

source: This maintenance version comes with no new feature. It only fixes various problem. This release is comptabible with GLPI greater than 0.83.3 and up to 0.84.
fr: Cette version de maintenance n'apporte aucune nouveauté. Elle corrige différents problèmes. Cette version est compatible avec la version de GLPI 0.83.3 et supérieur jusqu'à 0.84.

source: If you already test GLPI 0.84, you can help [[us to debug the future stable release|news/2013/02/12/Plugin_FusionInventory_0.84+1.0_beta-test_bug_hunter]].
fr: Si vous testez GLPI 0.84, vous pouvez nous aider [[ à débuger la future version stable de FusionInventory For GLPI|news/2013/02/12/Plugin_FusionInventory_0.84+1.0_beta-test_bug_hunter]].

source: As usual, the upgrade process is documented. Please take 5 minutes of your time to read the documentation first: <http://www.fusioninventory.org/documentation/fi4g/installation/>
fr: Comme d'habitude, la mise à niveau est documenté. SVP prenez 5 minutes de votre temps pour lire la documentation : <http://www.fusioninventory.org/documentation/fi4g/installation/>

source: This version fixes:
fr: Cette version corrige:

source: task and taskjob name cutted when the ' character is present in the name
fr: Nom de tâche et de tâche de travail coupé quand le caractère ' est présent dans le nom

source: compatibility with last version of the _manufacturer plugin_
fr: Compatibilité avec la dernière version du _plugin manufacturer_

source: fix CSS problem in due date of the GLPI tickets
fr: Corrige le problème de CSS dans la date d'échéance des tickets GLPI

source: fix error on upgrade plugin
fr: Corrige l'erreur lors de la mise à niveau du plugin

source: fix right problem on computer groups
fr: Corrige le problème de droit sur les groupes d'ordinateur

source: fix duplicated fields in general config of SNMP (keep SNMP history)
fr: Corrige les champs dupliqués dans la configuration générale de SNMP (keep SNMP history)

source: manage virtual networkport card of computer and switch connection try to connect first the physical card instead of the virtual.
fr: Gestion du port réseau virtuel de l'ordinateur et l'essaie de connexion du switch à la première carte physique à la place du port virtuel

source: problem during automatic entity transfer entity (Computer)
fr: Problème pendant le transfert automatique entre entité (Ordinateur)

source: enhance SNMP model creation tool (with community tool)
fr: Amélioration de l'outil de création de modèle SNMP (avec l'outil communautaire)

source: See all tickets here: <http://forge.fusioninventory.org/versions/157>
fr: Reportez vous aux tickets ici :<http://forge.fusioninventory.org/versions/157>

source: You can download it here: <http://forge.fusioninventory.org/attachments/download/1001/fusioninventory-for-glpi-metapackage_0.83%202.3.tar.gz>
fr: Vous pouvez la télécharger ici :<http://forge.fusioninventory.org/attachments/download/1001/fusioninventory-for-glpi-metapackage_0.83%202.3.tar.gz>
