Repository: C-Duv/fusioninventory.github.io
Catalog: news/2014/09/25/FusionInventory-Agent-2.3.11.*.po
Languages: fr

source: FusionInventory Agent 2.3.11 release
fr: L'Agent FusionInventory 2.3.11 est sorti

source: Hello FusionInventory users,
fr: Hello les fans de FusionInventory

source: The FusionInventory Agent maintainers are glad to announce the 2.3.11 release.
fr: Les développeurs de l'Agent FusionInventory sont heureux de vous annoncer la sortie de la version 2.3.11

source: You can download it from the usual places:
fr: Vous pouvez le télécharger aux endroits habituels:

source: [the forge](http://forge.fusioninventory.org/projects/fusioninventory-agent/files) or [CPAN](https://metacpan.org/release/FusionInventory-Agent) for the source distribution
fr: La [forge](http://forge.fusioninventory.org/projects/fusioninventory-agent/files) ou [CPAN](https://metacpan.org/release/FusionInventory-Agent) pour la version distribution

source: [the forge](http://forge.fusioninventory.org/projects/fusioninventory-agent-windows-installer/files) for the windows distribution
fr: La [Forge](http://forge.fusioninventory.org/projects/fusioninventory-agent-windows-installer/files) pour la version Windows

source: See [[download instructions|/documentation/agent/installation]] for details.
fr: Voir [[instructions|/documentation/agent/installation]] pour les détails

source: The major changes in this release are multiple:
fr: Les changements majeurs dans cette version sont multiples:

source: network inventory now relies on dedicated data to identify printer consumables, instead of relying on an external consumable reference database
fr: L'inventaire réseau s'appuie maintenant sur des données dédiées pour identifier les consommables d'imprimante à la place de données externes de référence

source: network inventory now report aggregated ports for network devices, supporting LACP and AGP protocols
fr: L'inventaire réseau supporte désormais la remontée des équipements réseaux utilisant les protocoles LACP et AGP

source: local inventory report network interfaces type (wireless, wired, bonded, etc...) with additional specific information (ESSID for wifi, base interface for aliases, etc...)
fr: L'inventaire local identifie les types d'interface réseau (wireless, wired, bonded,...) avec l'ajout d'information spécifique (ESSID pour le Wifi, base interface pour les alias,...)

source: better logging of agent execution details, with more details about missing optional commands or perl libraries, or information to add in agent database
fr: Un meilleur logging pour les details de l'exécution de l'agent, avec plus de détails pour les commandes optionnelles ou librairies Perl, ou les informations ajoutées dans la base

source: In addition, this release also fixes multiple smaller issues.
fr: Également, cette version corrige aussi plusieurs petits bug.

source: We did our best to provide a solid release, please [[contact us|/resources]] if you believe you find something unexpected.
fr: Nous avons fait notre possible pour rendre cette version solide, si vous croyez avoir trouvé un problème, SVP [[contactez nous|/resources]]
