Repository: C-Duv/fusioninventory.github.io
Catalog: news/2014/12/23/FusionInventory-for-GLPI-0.85+1.0.*.po
Languages: fr

source: FusionInventory plugin for GLPI 0.85+1.0 release
fr: Le plugin FusionInventory For GLPI 0.85+1.0 est sorti

source: Hello FusionInventory users,
fr: Hello les fans de FusionInventory

source: After many months of development by me and kiniou, the first version compatible with GLPI 0.85.x is available.
fr: Après plusieurs mois de développement par kiniou et moi même, la première version compatible avec GLPI 0.85.x est disponible.

source: This is the new features:
fr: Voici les nouvelles fonctions:

source: You can lock a field for an itemtype (for example lock contact field for all computers) [ticket 1184](http://forge.fusioninventory.org/issues/1184)
fr: Vous pouvez verrouiller un champ pour un item type (par exemple champ de contact de verrouillage pour tous les ordinateurs) [ticket 1184](http://forge.fusioninventory.org/issues/1184)

source: [COMPUTER INVENTORY]
fr: [Inventaire ordinateur]

source: Speed of computer network ports is now managed [ticket 2439](http://forge.fusioninventory.org/issues/2439)
fr: La vitesse des ports réseaux informatique est maintenant gérée [ticket 2439](http://forge.fusioninventory.org/issues/2439)

source: [RULES]
fr: [Règles]

source: You can reset the import rules and recreate default rules [ticket 1271](http://forge.fusioninventory.org/issues/1271)
fr: Vous pouvez réinitialiser les règles d'import et recréer les règles par défaut [ticket 1271](http://forge.fusioninventory.org/issues/1271)

source: Monitor, printers and peripheral of computer pass now in the import rules [ticket 2204](http://forge.fusioninventory.org/issues/2204)
fr: Écran, imprimante et périphériques de l'ordinateur passe maintenant par des règles d'import [ticket 2204](http://forge.fusioninventory.org/issues/2204)

source: Add field 'domain' in import rules [ticket 2333](http://forge.fusioninventory.org/issues/2333)
fr: Ajout d'un champ 'domain' dans les règles d'import [ticket 2333](http://forge.fusioninventory.org/issues/2333)

source: New default import rules [ticket 2793](http://forge.fusioninventory.org/issues/2793)
fr: Nouvelles règles d'import par défaut [ticket 2793](http://forge.fusioninventory.org/issues/2793)

source: When do a network discovery, it use the SNMP credentials defined in the IP range + management of the order [ticket 2237](http://forge.fusioninventory.org/issues/2237)
fr: Quand une découverte réseau est faite, elle utilise les identifiants SNMP défini dans le range IP et gestion de l'ordre [ticket 2237](http://forge.fusioninventory.org/issues/2237)

source: Remove SNMP models like we said since many months [ticket 2465](http://forge.fusioninventory.org/issues/2465)
fr: Suppression des modèles SNMP comme nous l'avons annoncé depuis quelques mois [ticket 2465](http://forge.fusioninventory.org/issues/2465)

source: [TASK]
fr: [Tâche]

source: Task management rewriten and add agent-driven mode (ondemand) with timeslot for execution (define when run), monitoring logs... [ticket 2371](http://forge.fusioninventory.org/issues/2371)
fr: Réécriture du management des tâches et ajout d'un mode «agent-driven» (ondemand) avec un intervalle de temps pour l'exécution (détermine le lancement), monotoring des logs... [ticket 2371](http://forge.fusioninventory.org/issues/2371)

source: [DEPLOY]
fr: [Déploiement]

source: Import and export packages for deployment [ticket 2475](http://forge.fusioninventory.org/issues/2475)
fr: Import et export des paquets de déploiement [ticket 2475](http://forge.fusioninventory.org/issues/2475)

source: [OTHERS]
fr: [Autres]

source: Add cron for delete agent not contacted the server since xx weeks/months [ticket 1708](http://forge.fusioninventory.org/issues/1708)
fr: Ajout d'un cron pour la suppression des agents n'ayant pas recontacté le serveur depuis xx semaines/mois [ticket 1708](http://forge.fusioninventory.org/issues/1708)

source: Add icon beside computer, printer... field to see if the field is locked or not [ticket 2534](http://forge.fusioninventory.org/issues/2534)
fr: Ajout d'une icône à coté du champs ordinateur, imprimante,... pour voir s'il est ou non verrouillé [ticket 2534](http://forge.fusioninventory.org/issues/2534)

source: New rights [ticket 2214](http://forge.fusioninventory.org/issues/2214)
fr: Nouveaux droits [ticket 2214](http://forge.fusioninventory.org/issues/2214)

source: More information:
fr: Pour en savoir plus:

source: You can see the [changelog](http://forge.fusioninventory.org/versions/97)
fr: vous pouvez regarder les [changelog](http://forge.fusioninventory.org/versions/97)

source: You can [download](http://forge.fusioninventory.org/attachments/download/1719/fusioninventory-for-glpi_0.85+1.0.tar.gz)
fr: Vous pouvez le télécharger [ici](http://forge.fusioninventory.org/attachments/download/1719/fusioninventory-for-glpi_0.85+1.0.tar.gz)

source: Thanks again to people who test, report bugs / features, translate... ;)
fr: Un grand merci à tous ceux qui ont testé, reporté des bugs/features, traduit... ;)
