Repository: C-Duv/fusioninventory.github.io
Catalog: documentation.*.po
Languages: fr

source: FusionInventory Agent
fr: Agent FusionInventory

source: [[Report bug|documentation/agent/bugreport]]
fr: [[Signaler un bug|documentation/agent/bugreport]]

source: [[References documentation|documentation/references]]
fr: [[Documentation de références|documentation/references]]

source: [[Network less inventory|documentation/agent/network_less]]
fr: [[Inventaire hors réseau|documentation/agent/network_less]]

source: [[Force an inventory|documentation/agent/launch_the_agent]]
fr: [[Forcer un inventaire|documentation/agent/launch_the_agent]]

source: FusionInventory for GLPI
fr: FusionInventory pour GLPI

source: [[How to install or update FusionInventory for GLPI|documentation/fi4g/installation]]
fr: [[Installation ou mise à jour de FusionInventory pour GLPI|documentation/fi4g/installation]]

source: [[How works «Equipment import and link rules»|documentation/fi4g/importrules]]
fr: [[Procédures sur les «Règles d'import et de liaison des matériels»|documentation/fi4g/importrules]]

source: [[How to scan my network|documentation/fi4g/networkdiscovery]]
fr: [[Comment scanner mon réseau|documentation/fi4g/networkdiscovery]]

source: [[How to inventory my ESX server|documentation/fi4g/esxinventory]]
fr: [[Comment inventorier mon serveur ESX|documentation/fi4g/esxinventory]]

source: [[How to deploy softwares with software deployment module|documentation/fi4g/deploy]]
fr: [[Comment déployer des logiciels avec le module déploiement|documentation/fi4g/deploy]]

source: [[How to deal with DMZ network|documentation/fi4g/dmz]]
fr: [[Comment faire avec un réseau DMZ|documentation/fi4g/dmz]]

source: Troubleshooting
fr: Procédure de dépannage

source: Advanced topics
fr: Rubriques avancées

source: [[Create and manage SNMP models|documentation/fi4g/snmpmodels]]
fr: [[Création et gestion des modèles SNMP|documentation/fi4g/snmpmodels]]

source: [[Security and SSL|documentation/agent/security_and_ssl]]
fr: [[Securité et SSL|documentation/agent/security_and_ssl]]

source: [[Extend a computer inventory content|documentation/agent/additional_content]]
fr: [[Ajouter un contenu à l'inventaire machine|documentation/agent/additional_content]]

source: Bug report
fr: Signaler un bug

source: [[Report a bug on the Agent|documentation/agent/bugreport]]
fr: [[Signaler un bug de l'Agent|documentation/agent/bugreport]]

source: Contributor
fr: Contribution

source: [[How to use this wiki|documentation/wiki]]
fr: [[Comment utiliser ce wiki|documentation/wiki]]

source: [[for developers|documentation/dev]]
fr: [[Pour les développeurs|documentation/dev]]
