Repository: C-Duv/fusioninventory.github.io
Catalog: forge.*.po
Languages: fr

source: FusionInventory for developers
fr: FusionInventory pour les développeurs

source: <http://www.fusioninventory.org/> is the official web site.
fr: <http://www.fusioninventory.org/> est le site web officiel.

source: Development forge
fr: Forge de développement

source: Developement is done on FusionInventory forge: <http://forge.fusioninventory.org/>.
fr: Le développement est fait sur la Forge FusionInventory : <http://forge.fusioninventory.

source: The forge includes Bugtracker, Download page, Source browser and internal Wiki.
fr: La Forge inclue le Bugtracker, la page de téléchargement, la vue des sources et un Wiki interne.

source: Git repositories are mirrored on [Github FusionInventory page](http://www.github.com/fusinv) regulary.
fr: Le dépôt Git est synchronisé sur la page [Github de FusionInventory](http://www.github.com/fusinv) régulièrement.

source: Patches, bug reports, feedbacks and new ideas are welcome. Please just contact us directly if you want to:
fr: Les patchs, report de bug, retour d'expérience et nouvelles idées sont les bienvenues. Contactez nousdirectement si vous avez :

source: developer a new feature
fr: développé une nouvelle fonction

source: submit a bug
fr: Soumis un bug

source: [[You can find who to contact us here|resources]].
fr: Vous trouverez comment nous contacter [[ici|resources]].
