Repository: C-Duv/fusioninventory.github.io
Catalog: overview.*.po
Languages: fr

source: Feature Overview
fr: Vue des fonctionnalités

source: Automated update of the assets
fr: Mise à jour automatique des équipements

source: FusionInventory acts like a gateway and collect information sent by the agents. It will create or update the information in GLPI it minimal effort from the administrator.
fr: L'agent FusionInventory agit comme une passerelle et un collecteur d'information. Il crée et met à jour les données de GLPI dans un minimum d'effort

source: For now, these class of devices are supported:
fr: Pour le moment, les classes suivantes d'équipement sont supportées :

source: Computers
fr: Ordinateurs

source: Network devices
fr: Équipements réseaux

source: Printers
fr: Imprimantes

source: Virtual machines
fr: Machines virtuelles

source: Android phone
fr: Téléphone Android

source: Virtual machines inventory
fr: Inventaire des machines virtuelles

source: FusionInventory supports different virtualization mechanisms.
fr: FusionInventory supporte divers systèmes de virtualisation

source: Software deployment
fr: Déploiement de logiciel

source: You can use FusionInventory to install, update or remove software. You can also push administration scripts.
fr: Vous pouvez utiliser FusionInventory pour installer, mettre à jour ou supprimer un logiciel. Vous pouvez également pousser vos scripts d'administration.

source: The solution can be run on any kind of operating system, espcially:
fr: Cette solution peut fonctionner sur toute sorte de système d'exploitation, en particulier :

source: FusionInventory is designed to take care of the network bandwidth.
fr: FusionInventory est conçu pour préserver la bande passante du réseau.

source: The agent can send Wake on Lan order on its local network. By using the GLPI plugin, you can planify when computers have to be awaken and from which agent.
fr: L'agent peut envoyer un ordre WakeOnLan (réveil par réseau) sur son réseau local. En utilisant le plugin GLPI, vous pouvez planifier quand les PC seront réveillés par un agent.

source: The solution main components
fr: Les éléments de cette solution

source: The agent
fr: L'agent

source: The __FusionInventory Agent__ is a generic multi-platform agent. It can perform a large array of management tasks, such as local inventory, software deployment or network discovery. It can be used either standalone, or in combination with a compatible server (OCS Inventory, GLPI, OTRS, Uranos, ...) acting as a centralized control point.
fr: L'__Agent FusionInventory__ est un agent généric multi-plateforme. Il permet d'effectuer un large éventail de tâches de gestion, tel que l'inventaire local, le déploiement de logiciels ou la découverte du réseau. Il peut être utilisé seul ou avec un serveur compatible (OCS Inventory, GLPI, OTRS, Uranos, ...) qui centralisera le controle de l'agent.

source: Two of these tasks are included in agent source distribution, local inventory and wake on lan. Other tasks are distributed separatly, excepted for binary distributions where they are bundled together.
fr: Deux de ces tâches sont incluses dans la version source de l'agent, inventaire local et Wake on LAN. D'autres tâches sont distribuées séparément, sauf pour les versions binaires où ils sont incluses dans l'exécutable.

source: The GLPI Plugin
fr: Le plugin GLPI

source: [GLPI](http://www.glpi-project.org) is the Information Resource-Manager with an additional Administration Interface.
fr: [GLPI](http://www.glpi-project.org) est un gestionnaire d'information avec en une interface d'administration.

source: You can use it to build up a database with an inventory for your company (computer, software, printers, ...). It has enhanced functions to make the daily life for the administrators easier, like a job tracking system with mail-notification and methods to build a database with information about your network-topology.
fr: Vous pouvez l'utiliser pour créer une base de données avec un inventaire de votre entreprise (ordinateur, logiciels, imprimantes, ...). Il a des fonctions améliorées pour rendre la vie quotidienne plus facile aux administrateurs, comme un système de suivi des incidents avec notification par mail et des méthodes pour construire une base de données avec des informations sur la topologie de votre réseau.

source: GLPI also comes with an integrated Request Tracking solution.
fr: GLPI est également livré avec une solution intégrée de suivi de demande.

source: __FusionInventory for GLPI__ is a plugin for GLPI.
fr: __FusionInventory for GLPI__ est un plugin pour GLPI

source: The big picture
fr: Vue du système

source: subgraph cluster_0 { style=filled; color=lightgrey; node [style=filled,color=white]; "FusionInventory for GLPI" -> "GLPI engine" -> "DB"; label = "GLPI"; }
fr: subgraph cluster_0 { style=filled; color=lightgrey; node [style=filled,color=white]; "FusionInventory for GLPI" -> "moteur GLPI" -> "BD"; label = "GLPI"; }

source: color=gainsboro; "Local Inventory" -> "Agent" -> "FusionInventory for GLPI"; "ESX Inventory" -> "Agent"; "Network Inventory" -> "Agent"; "Agent" -> "Deploy"; label = "FusionInventory Agent"; }
fr: color=gainsboro; "Inventaire Local" -> "Agent" -> "FusionInventory for GLPI"; "Inventaire ESX" -> "Agent"; "Inventaire Réseau" -> "Agent"; "Agent" -> "Deployer"; label = "FusionInventory Agent"; }

source: style=filled; color=lightgrey; node [style=filled,color=white]; "dmidecode" -> "Local Inventory"; "dpkg" -> "Local Inventory"; "registry" -> "Local Inventory"; "rpm" -> "Local Inventory"; "WMI" -> "Local Inventory"; "dmidecode" -> "Local Inventory"; "PCI info" -> "Local Inventory"; "USB info" -> "Local Inventory"; "virtual machines" -> "Local Inventory"; "more" -> "Local Inventory"; "Deploy" -> "set some configuration"; "Deploy" -> "add software"; label = "Computer(s)"; }
fr: style=filled; color=lightgrey; node [style=filled,color=white]; "dmidecode" -> "Inventaire Local"; "dpkg" -> "Inventaire Local"; "registry" -> "Inventaire Local"; "rpm" -> "Inventaire Local"; "WMI" -> "Inventaire Local"; "dmidecode" -> "Inventaire Local"; "PCI info" -> "Inventaire Local"; "USB info" -> "Inventaire Local"; "Machines Virtuelles" -> "Inventaire Local"; "Autres" -> "Inventaire Local"; "Deployer" -> "Configuration Système"; "Deployer" -> "Ajout Logiciel"; label = "Ordinateur(s)"; }

source: subgraph cluster_2 { style=filled; color=lightgrey; node [style=filled,color=white]; "vCenter1" -> "ESX Inventory"; "esx4" -> "ESX Inventory";
fr: subgraph cluster_2 { style=filled; color=lightgrey; node [style=filled,color=white]; "vCenter1" -> "Inventaire ESX"; "esx4" -> "Inventaire ESX";

source: subgraph cluster_3 { style=filled; color=lightgrey; node [style=filled,color=white]; "printer 1" -> "Network Inventory"; "printer 2" -> "Network Inventory"; "switch 1" -> "Network Inventory"; "unknown device" -> "Network Inventory"; label = "Networks"; }
fr: subgraph cluster_3 { style=filled; color=lightgrey; node [style=filled,color=white]; "imprimante 1" -> "Inventaire Réseau"; "imprimante 2" -> "Inventaire Réseau"; "switch 1" -> "Inventaire Réseau"; "Matériel inconnu" -> "Inventaire Réseau"; label = "Réseau"; }
