Repository: C-Duv/fusioninventory.github.io
Catalog: resources.*.po
Languages: fr

source: Resources and web sites
fr: Ressources et sites Web

source: Mailing lists
fr: Listes de diffusions

source: Please use english langage as much as possible.
fr: S'il vous plait, utilisez l'anglais le plus possible.

source: [FusionInventory Users list](http://lists.alioth.debian.org/mailman/listinfo/fusioninventory-user)
fr: [Liste des utilisateurs de FusionInventory](http://lists.alioth.debian.org/mailman/listinfo/fusioninventory-user)

source: [FusionInventory Developers list](http://lists.alioth.debian.org/mailman/listinfo/fusioninventory-devel)
fr: [Liste des développeurs de FusionInventory](http://lists.alioth.debian.org/mailman/listinfo/fusioninventory-devel)

source: [FusinInventory translator list](http://lists.alioth.debian.org/mailman/listinfo/fusioninventory-i18n)
fr: [Liste des traducteurs de FusionInventory](http://lists.alioth.debian.org/mailman/listinfo/fusioninventory-i18n)

source: IRC-Channel
fr: Canal IRC

source: FusionInventory has got an IRC chanel on Freenode call __#fusioninventory__. IRC is used mainly to coordonate developement effort between contributors.
fr: FusionInventory utilise un canal IRC sur Freenode nommé __#fusioninventory__. IRC est surtout utilisé pour coordonner le développement entre les contributeurs.

source: Network: [FreeNode](http://irc.freenode.net)
fr: Réseau: [FreeNode](http://irc.freenode.net)

source: Channel: #fusioninventory
fr: Canal: #fusioninventory

source: [A forum](http://forum.fusioninventory.org/) is also avalaible for end users. This forum is not directly supported by the FusionInventory team but by the users.
fr: [Un forum](http://forum.fusioninventory.org/) est aussi disponible pour les utilisateurs. Ce forum n'est pas directement supporté par l'équipe de FusionInventory mais pas les utilisateurs.

source: If you want to report bugs or contract the developement team, please use the mailing lists or the bug tracker on the forge.
fr: Si vous désirez signaler un bugs ou contacter l'équipe de développement, veuillez utiliser la liste de diffusion ou le gestionnaire de bug de la Forge.

source: Partners
fr: Partenaires

source: A list of trusted companies is maintain on the [[partners]] page. Those companies are involved in FusionInventory developement.
fr: La liste des entreprises partenaires est disponible sur la page: [[partners]]. Ces entreprises participent au développement de FusionInventory.
