Repository: C-Duv/fusioninventory.github.io
Catalog: documentation/agent/man/fusioninventory-esx.*.po
Languages: fr

source: NAME
fr: Nom

source: fusioninventory-esx - vCenter/ESX/ESXi remote inventory from command line
fr: fusioninventory-esx - commande d'inventaire distant des vCenter/ESX/ESXi

source: Options: --help this menu --host hostname ESX server hostname --user username user name --password xxxx user password --directory directory output directory --tag tag tag for the inventoried machine
fr: Options: --help ce menu --host hostname hostname du serveur ESX --user username nom d'utilisateur --password xxxx password de l'utilisateur --directory directory dossier destinataire --tag tag tag pour la machine inventoriée

source: EXAMPLES
fr: EXEMPLES

source: % fusioninventory-esx --host myesx --user foo --password bar --directory /tmp
fr: % fusioninventory-esx --host server_esx --user admin --password secret --directory /opt

source: You can import the .ocs file in your inventory server with the fusioninventory-injector tool. %fusioninventory-injector -v --file /tmp/\*.ocs -u https://myserver/ocsinventory
fr: Vous pouvez importer le fichier .ocs sur votre serveur d'inventaire avec l'outil fusioninventory-injector. %fusioninventory-injector -v --file /tmp/\*.ocs -u https://mon-serveur/ocsinventory

source: `fusioninventory-esx` creates inventory of remote ESX/ESXi and vCenter VMware. It uses the SOAP interface of the remote server.
fr: `fusioninventory-esx` créait des inventaires des serveurs VMware ESX/ESXi et vCenter.Il utilise l'interface SOAP du serveur distant.

source: Supported systems:
fr: Systèmes reconnus:

source: - `ESX and ESXi 3.5` - `ESX and ESXi 4.1` - `ESXi 5.0` - `vCenter 4.1` - `vCenter 5.0`
fr: - `ESX et ESXi 3.5` - `ESX et ESXi 4.1` - `ESXi 5.0` - `vCenter 4.1` - `vCenter 5.0`

source: Active Directory users, please note the AD authentication doesn't work. You must create a account on the VMware server.
fr: Pour les utilisateurs d'Active Directory, attention l'authentification par l'AD n'est pas possible. Vous devez créer de compte sur le serveur VMware.

source: So far, ESX serial number are not collected.
fr: Pour l'instant, le numéro de série de l'ESX n'est pas collecté.

source: SECURITY
fr: SECURITÉ

source: The SSL hostname check of the server is disabled.
fr: La vérification SSL du hostname du serveur est désactivée.
