Repository: C-Duv/fusioninventory.github.io
Catalog: news/2014/05/17/FusionInventory_at_SolutionLinux_*_Paris.*.po
Languages: fr

source: Hello FusionInventory users and future users,
fr: Hello les utilisateurs de FusionInventory ainsi que les futurs utilisateurs,

source: The FusionInventory team will be present in Paris (France), the 20 and 21 May 2014, at meeting [SolutionLinux](http://www.solutionslinux.fr/).
fr: L'équipe de FusionInventory sera présente à Paris (France), les 20 et 21 Mai 2014, au salon [SolutionLinux](http://www.solutionslinux.fr/).

source: The developpers present at the exhibition stand are:
fr: Les développeurs présents sur le stand sont :

source: David Durieux (the 2 days)
fr: David Durieux (les 2 jours)

source: Guillaume Rousse (the 21 only)
fr: Guillaume ROusse (le 21 seulement)

source: Kevin Roy (the 2 days)
fr: Kevin Roy (les 2 jours)

source: So if you want to speak agent developpment, prefer come the 21 instead the 20.
fr: Donc, si vous souhaitez parler développement pour l'agent, venez plutôt le 21.

source: For people come on stand, we will offer a very nice FusionInventory gobelet:
fr: Pour les personnes qui viendront sur le stand, on vous offira un beau gobelet FusionInventory :

source: In the background of the stand, you will see too a unique comic from [commitstrip](http://www.commitstrip.com/) created for us.
fr: En fond de stand, vous pourrez voir un dessin unique de [commitstrip](http://www.commitstrip.com/) créé pour nous.

source: Know too we will share the stand with [GLPI project](http://www.glpi-project.org/) ;)
fr: Savez enfin que le stand sera partagé avec [GLPI project](http://www.glpi-project).

source: See you at SolutionLinux!
fr: On se voit à SolutionLinux!
