Repository: C-Duv/fusioninventory.github.io
Catalog: documentation/fi4g/importrules.*.po
Languages: fr

source: How works 'Equipment import and link rules'
fr: Comment fonctionne l'importation d'équipement et les règles de lien

source: [[!template id=warning text="“Equipment import and link rules” are complex and misconfiguration can seriously hurt your GLPI."]]
fr: [[!template id=warning text="“L'importation d'équipement et les règles de lien” sont complexes et des erreurs de configuration peuvent sérieusement affecter voter GLPI."]]

source: First thing to know
fr: Première chose à savoir

source: The rules engine goal is to detect if a device exists of if it has to be created.
fr: Les règles du moteur ont pour but de détecter si un appareil existe ou s'il doit être créé.

source: The rule engine is used for:
fr: Le moteur de règles est utilisé pour:

source: computer
fr: ordinateur

source: network devices
fr: appareils réseau

source: network printer
fr: imprimantes réseau

source: Common problems related to the rule engine are:
fr: Les problèmes courants liés au moteur de règles sont

source: duplicated device.
fr: double appareil

source: device pushed in the “Ignored import devices”
fr: les appareils sont mis dans les “appareils importés ignorés”

source: subgraph cluster_0 { style=filled; color=lightgrey; node [style=filled,color=white]; "collector" -> "EQUIPMENT IMPORT AND LINK RULES"; "EQUIPMENT IMPORT AND LINK RULES" -> "machine found"; "EQUIPMENT IMPORT AND LINK RULES" -> "machine not found"; "EQUIPMENT IMPORT AND LINK RULES" -> "not enough criterias"; "machine found" -> "update"; "machine not found" -> "creates"; "not enough criterias" -> "pushed in “Ignored import list”"; "creates" -> "machine found"; label = "GLPI"; }
fr: subgraph cluster_0 { style=filled; color=lightgrey; node [style=filled,color=white]; "collector" -> "IMPORTATION D’ÉQUIPEMENT ET RÈGLES DE LIEN"; "IMPORTATION D’ÉQUIPEMENT ET RÈGLES DE LIEN" -> "machine trouvée"; "IMPORTATION D’ÉQUIPEMENT ET RÈGLES DE LIEN" -> "machine non trouvée"; "IMPORTATION D’ÉQUIPEMENT ET RÈGLES DE LIEN" -> "pas assez de critères"; "machine trouvée" -> "mise à jour"; "machine non trouvée" -> "creation"; "pas assez de critères" -> "mis dans “liste d’import ignorés”"; "creation" -> "machine trouvée"; label = "GLPI"; }

source: "Inventory" -> "collector"; "machine found" [ shape = "Mdiamond" ]; "machine not found" [ shape = "Mdiamond" ]; "not enough criterias" [ shape = "Mdiamond" ];
fr: "Inventaire" -> "collector"; "machine trouvée" [ shape = "Mdiamond" ]; "machine non trouvée" [ shape = "Mdiamond" ]; "pas assez de critères" [ shape = "Mdiamond" ];

source: The engine stops on the first checked rule.
fr: Le moteur s'arrête sur la première règle vérifiée.

source: When these rules are played?
fr: Quand ces règles sont elles jouées?

source: It's played in these cases:
fr: c'est joué dans ces cas:

source: Computer inventory, including ESX servers
fr: Inventaire d'ordinateurs, incluant les serveurs ESX

source: Network discovery
fr: La découverte du réseau

source: Network Inventory (switches, printers...)
fr: Inventaire du réseau (switchs, imprimantes...)

source: [[!template id=note text="Port MAC addresses from network switch are not used as criterias"]]
fr: [[!template id=note text="Les adresses port MAC du switch réseau ne sont pas utilisées comme critères"]]

source: Criteria of a rule
fr: Critères d'une règle

source: The criteria can be either normal or global.
fr: Les critères peuvent aussi bien être normaux ou globaux.

source: Normal criteria
fr: Critères normaux

source: The normal criteria are defined by an information (IP, MAC, etc) and a filter:
fr: Les critères normaux sont définis par une information (IP, MAC, etc) et un filtre:

source: _is_
fr: _is_ (est)

source: _is not_
fr: _is not_ (n'est pas)

source: _contains_
fr: _contains_ (contient)

source: _does not contains_
fr: _does not contains_ (ne contient pas)

source: _starting with_
fr: _starting with_ (commence par)

source: _finished by_
fr: _finished by_ (fini part)

source: _regular expression checks_
fr: _regular expression checks_ (contrôles d'expressions régulières)

source: _regular expression does not match_
fr: _regular expression does not match_ (expression régulière ne correspond pas)

source: _exists_: mean the value exist and not be empty in the inventory come from the agent
fr: _exists_: signifie que la valeur existe et n'est pas vide dans l'inventaire venant de l' agent

source: _does not exist_: mean the value doesn't exist in the inventory come from the agent
fr: _does not exist_: signifie que la valeur n'existe pas dans l'inventaire venant de l' agent

source: Global criteria
fr: Critères globaux

source: _Search GLPI equipement with this status_: search in GLPI database if the device exist with value defined
fr: _Search GLPI equipement with this status_: cherche dans la base de données GLPI si l' appareil existe avec la valeur définie.

source: If the device is found, all criteria are checked, this rule is checked and now run the actions
fr: Si l' appareil est trouvé, tous les critères sont vérifiés, cette règle est vérifiée et maintenant les actions sont lancées

source: Actions of a rule
fr: Actions d'une règle

source: The actions are defined by:
fr: Les actions sont définies par:

source: _FusionInventory link_ > _Link if possible, else create device_: if device is found (in case use a global criteria), update this device, else create a new device with itemtype defined in inventory (computer, switches...)
fr: _FusionInventory link_ > _Link if possible, else create device_: si l'appareil est trouvé (dans ce cas utilisez un critère global), mettre à jour cet appareil, autre créer un nouvel appareil avec un itemtype défini dans l'inventaire (ordinateur, switchs...)

source: _FusionInventory link_ > _Link if possible, else import denied_: if device is found (in case use a global criteria), update this device, else deny creation of device and so is not be imported in GLPI inventory
fr: _FusionInventory link_ > _Link if possible, else import denied_: si l'appareil est trouvé (dans ce cas utilisez un critère global), mettre à jour cet appareil, autre refuser la création d'appareil et n'est donc pas impoté dans l'inventaire GLPI

source: _FusionInventory link_ > _Import denied_
fr: _FusionInventory link_ > _Import denied_: Importation refusée
