Repository: C-Duv/fusioninventory.github.io
Catalog: documentation/fi4g/installation.*.po
Languages: fr

source: FusionInventory for GLPI installation
fr: Installation de FusionInventory For GLPI

source: Get the archive for your GLPI
fr: Téléchargez l'archive pour votre version de GLPI

source: First, download archive the here: <http://forge.fusioninventory.org/projects/fusioninventory-for-glpi/files>
fr: En premier, trouvez l'archive ici : <http://forge.fusioninventory.org/projects/fusioninventory-for-glpi/files>

source: FusionInventory for GLPI tarball name follow this convention:
fr: Le nom du fichier de FusionInventory For GLPI utilise cette convention :

source: fusioninventory-for-glpi-metapackage_
fr: fusioninventory-for-glpi-paquet_

source: GLPI major release (0.80, 0.83, 0.84, etc)
fr: numéro de version majeur GLPI (0.80, 0.83, 0.84, etc)

source: a '+' symbol
fr: un symbole '+'

source: FusionInventory release
fr: numéro de version de FusionInventory

source: WebServices GLPI plugin is a dependency of the Deploy feature, you can download it from the forge: <https://forge.indepnet.net/projects/webservices/files>
fr: le plugin WebService pour GLPI est nécessaire pour l'utilisation du déploiement ,vous pouvez le télécharger sur la Forge : <https://forge.indepnet.net/projects/webservices/files>

source: Update
fr: Mise à jour

source: You *must* *FIRST* disabled the FusionInventory plugins and move somewhere else the FusionInventory plugins. This to ensure deprecated files will properly be removed.
fr: Vous *devez en PREMIER* désactiver le plugin FusionInventory For GLPI et déplacer les dossiers du plugin FusionInventory for GLPI. Cela pour être que les fichiers obsolètes seront proprement enlevés.

source: [[!template id=warning text="Don't click on *UNINSTALL* link. If you do this, you will LOOSE all FusionInventory data."]]
fr: [[!template id=warning text="Ne cliquez pas sur le lien *Désinstaller*. Si vous faites ça, vous perdrez toutes les données de FusionInventory."]]

source: [[!template id=warning text="If a previous FusionInventory version is already installed, you must read the Update section."]]
fr: [[!template id=warning text="Si une ancienne version de FusionInventory est installée, vous devez lire la section *Mise à jour*."]]

source: It's also always a good idea to do a backup of your database.
fr: Vous devriez penser à sauvegarder votre base de donnée.

source: Uncompress the archive into the plugin folder of GLPI. File list seems to be like :
fr: Décompresser l'archive dans le dossier plugins de GLPI. La liste des fichiers devrait ressembler à ça :

source: Connect to _GLPI_
fr: Connectez vous à _GLPI_

source: Go in the menu _Setup_ > _Plugins_
fr: Allez dans le menu _Configuration_ > _Plugins_

source: Install the plugins
fr: Installez les plugins

source: Activate FusionInventory
fr: Activez les plugins

source: These operations will create or upgrade the database and set the correct rights on the plugin. Do the same for all fus* plugins
fr: Ces opérations vont créées ou mettre à jour la base de donnée et positionner correctement les droits sur les plugins. Faire la même chose sur tous les plugins Fus*.

source: Initial configuration
fr: Configuration initiale

source: Once the plugin is activated, you will have to go on the _Plugins > FusionInventory > General configuration_ page to set the *Service URL*. You need to enter the location of your GLPI server, for example `http://glpi.mydomain/`.
fr: Une fois que le plugin est activé, vous devrez aller dans le menu _Plugins > FusionInventory > Configuration générale_ pour paramétrer *URL d'accès au service*. Vous devrez écrire l'adresse de votre serveur GLPI, par exemple `http://glpi.mydomain/`.

source: Once these is done, you can [[install your first agent|documentation/agent/installation]].
fr: Une fois ces actions terminées, vous pouvez [[installer votre premier agent|documentation/agent/installation]].

source: Security
fr: Sécurité

source: [[!template id=warning text="We strongly recommend to activate SSL on the server side to ensure no one will be able to read password during authentifcation and [[for some other good reason|documentation/agent/security_and_ssl]]. A [[documentation is available to explain how to enable it|documentation/fi4g/ssl]]."]]
fr: [[!template id=warning text="Nous vous recommandons fortement d'activer SSL sur votre serveur pour être sûr que personne ne puisse lire le mot de passe pendant l'authentification et [[pour d'autre bonne raison|documentation/agent/security_and_ssl]]. Une [[documentation est disponible pour expliquer sa mise en service|documentation/fi4g/ssl]]."]]
