Repository: C-Duv/fusioninventory.github.io
Catalog: documentation/fi4g/networkdiscovery.*.po
Languages: fr

source: How to scan my network
fr: Comment scanner mon réseau

source: It's always a good idea to use an up to date agent for the network scan.
fr: C'est toujours une bonne idée d’utiliser un agent à jour pour les scannes du réseau.

source: Agent configuration
fr: Configuration de l'agent

source: By default, agent are not allowed to do network scan.
fr: Par défaut, les agents ne sont pas autorisés à faire un scan du réseau

source: There is two different way to grant them this privilege:
fr: Il y a deux manières différentes de leur accorder ce privilège:

source: Allow all: in menu _plugins_ > _FusionInventory_ > _Configuration_ and in tab _Agents modules_. You can check _Network discovery_ by default.
fr: Allow all: dans menu _plugins_ > _FusionInventory_ > _Configuration_ et dans l'onglet _Agents modules_. Vous pouvez cocher _Network discovery_ par défaut.

source: Allow ony some agents: in menu _plugins_ > _FusionInventory_ > _FusionInventory_ > _Agents management_ go in agent form and in tab _Agents modules_, check _Network discovery_.
fr: Allow ony some agents: dans menu _plugins_ > _FusionInventory_ > _FusionInventory_ > _Agents management_ aller dans agent form et dans l'onglet _Agents modules_, cocher _Network discovery_.

source: Network devices are inventoried using SNMP. You agent must be allowed to contact the devices. You may to add some specific privilege in a device Access Control List (ACL).
fr: Les appareils réseaux sont inventoriés en utilisant SNMP. Votre agent doit être autorisé à contacter les appareils. Vous pouvez ajouter quelques privilèges spécifiques dans un appareil Access Control List (ACL).

source: number of threads
fr: Nombre de processus

source: To have network discovery running more faster, you can define number of simultaneous IP queries. For exemple, if you use 10 threads, agent will query 10 IP is same time, and so it's very more faster.
fr: Pour avoir une exécution plus rapide de la découverte du réseau, vous pouvez définir le nombre de requêtes IP simultanées. Par exemple, si vous utilisez 10 processus, l'agent va interroger 10 IP en même temps et donc il est plus rapide.

source: You have 2 choices:
fr: Vous avez 2 choix:

source: General configuration: You can define it for all agents, in menu _plugins_ > _FusionInventory_ > _Configuration_ and in tab _FusionInventory SNMP_. define value _Threads number (network discovery)_.
fr: General configuration: Vous pouvez le définir pour tous les agents, dans menu _plugins_ > _FusionInventory_ > _Configuration_ et dans l'onglet _FusionInventory SNMP_. définissez la valeur _Threads number (network discovery)_.

source: Personalized configuration: you can overwrite general configuration for an agent (for exemple if the computer is better faster), in menu _plugins_ > _FusionInventory_ > _FusionInventory_ > _Agents management_ go in agent form and in tab _Threads number_, and define value _Threads number (network discovery)_.
fr: Personalized configuration: vous pouvez écraser la configuration générale pour un agent (par exemple si l' ordinateur est plus rapide), dans menu _plugins_ > _FusionInventory_ > _FusionInventory_ > _Agents management_ allez dans agent form et dans l'onglet _Threads number_, et définissez la valeur _Threads number (network discovery)_.

source: Network range
fr: Plages réseau

source: you need to register your network ranges in the “IP range configuration” configuration. You can associate a network to an entity, in this case, the devices found on this network will be created in the given entity.
fr: Vous devez enregistrer vos plages réseau dans “IP range configuration”. Vous pouvez associer un réseau à une entité, dans ce cas, les appareils trouvés sur ce réseau seront créés dans l'entité donnée.

source: Task creation
fr: La création de tâches

source: Now your agent is ready and the Network has been registered, you can create your first task. Go in _Task management (Normal)_ menu and create a new entry.
fr: Maintenant votre agent est prêt et le réseau a été enregistré, vous pouvez créer votre première tâche. Allez dans le menu _Task management (Normal)_ et créez une nouvelle entrée.

source: Please see the [[task creation|documentation/fi4g/tasks]] page.
fr: Merci d'allez voir la page [[task creation|documentation/fi4g/tasks]].
