Repository: C-Duv/fusioninventory.github.io
Catalog: news/2013/11/08/06/FusionInventory-Agent-2.3.3.*.po
Languages: fr

source: Hello FusionInventory users,
fr: Salut les FusionInventory users !

source: The FusionInventory Agent maintainers are glad to announce the 2.3.3 release.
fr: Voici une explication plus complète sur la nouvelle version 2.3.3.

source: The archive is available either on the [the forge](http://forge.fusioninventory.org/attachments/download/1147/FusionInventory-Agent-2.3.3.tar.gz) or directly from [the CPAN](https://metacpan.org/release/FusionInventory-Agent)
fr: Les fichiers sont disponibles sur la [Forge](http://forge.fusioninventory.org/attachments/download/1147/FusionInventory-Agent-2.3.3.tar.gz) ou directement sur [CPAN](https://metacpan.org/release/FusionInventory-Agent)

source: This release changelog
fr: Modifications pour cette version :

source: inventory task
fr: Tâche d'inventaire :

source: fix missing 32bits software on 64bits windows (#2212)
fr: Correction du problème des applications 32bits non inventorier sur les Windows 64bits (Bug#2212)

source: netinventory task
fr: Tâche netinventory (inventaire réseau) :

source: fix SNMP reconnection when issuing VLAN-specific queries on some Cisco devices (#2178)
fr: Correction des reconnections SNMP après l'échec de requête sur des VLAN spécifiés pour quelques équipements Cisco (bug#2178)

source: use longer default SNMP timeout, and make them configurable
fr: Utilisation d'un timeout défaut plus long pour SNMP, et le rendre configurable

source: handle MAC addresses with embedded VLAN identifier
fr: Traiter les adresses MAC avec les identifiants de VLAN intégrés

source: netdiscovery task
fr: Tâche netdiscovery (découverte réseau) :

source: backport device model identification from sysobjectid value
fr: Ajout de l'identification du modèle de l'équipement par la valeur sysobjectid

source: clean up in the distribution, thanks Olivier Mengué <dolmen@cpan.org>
fr: Nettoyage du code dans cette version, merci à Olivier Mengué <dolmen@cpan.org>

source: We did our best to provide a solid release, please [[contact us|/resources]] is you believe you find something unexpected.
fr: Nous faisons notre maximum pour construire des versions indéfectibles, si vous pensez avoir trouver quelque chose d'instable SVP [[contactez nous|/resources]]
