Repository: C-Duv/fusioninventory.github.io
Catalog: documentation/agent/bugreport.*.po
Languages: fr

source: How to report issues efficiently
fr: Comment signaler les problèmes efficacement

source: In order for the developers to track and fix issues properly, you need to use the forge bug tracker (<http://forge.fusioninventory.org/projects/fusioninventory-agent/issues>). An account is required.
fr: Pour aider les développeurs à trouver et régler les problèmes correctement,vous devez utiliser la gestionnaire de bug de la Forge (<http://forge.fusioninventory.org/projects/fusioninventory-agent/issues>). Vous devrez avoir un compte.

source: Here are a few usage rules, so as to avoid wasting efforts both for the reporters and for the assignees.
fr: Voici quelques règles d'usage, afin d'éviter de gaspiller des efforts à la fois pour ceux signalent le problème que ceux qui le résoudront.

source: Agent verbosity
fr: Verbosité de l'Agent

source: You can increase the agent verbosity if you:
fr: Vous pouvez augmenter la verbosité de l'Agent si vous :

source: add debug=2 in agent.cfg or set the debug key to 2 in the Windows registry. You will need to restart the daemon or service after that.
fr: ajoutez debug=2 dans agent.cfg ou modifiez la clé de registre debug a 2 pour Windows. Vous devrez relancer le démon ou service après.

source: call fusioninventory-agent with 2 `--debug` parameters: `fusioninventory-agent --debug --debug`
fr: lancez fusioninventory-agent avec 2 `--debug`, comme ça: `fusioninventory-agent --debug --debug`

source: Bug priority and category
fr: Priorité et catégorie des bugs

source: It is useless to set a priority, it will be re-evaluated by the assignee anyway.
fr: Il est inutile de définir une priorité, elle sera évaluée par celui en charge du problème.

source: However, you have to identify is your problem is an agent or a server issue. If you don't, that will be the first question anyway.
fr: Cependant, vous devrez identifier si le problème est dû à l'Agent ou au serveur. Cela sera la première question donc si vous ne savez pas...

source: The easiest way to make the distinction is to look at the raw XML content sent by the agent, available in GLPI. You can also force a local agent execution, with either `--stdout` or `--local /some/where` parameters, and look at the resulting content. If the information is missing or erroneous in the agent output, that's an agent issue. If the information is present, but not visible from the server, that's a server issue.
fr: La meilleure façon de faire la distinction consiste à examiner le contenu brut du XML envoyé par l'agent, disponible dans GLPI. Vous pouvez aussi forcer l'exécution de l'agent localement, soit avec `--stdout` ou `--local /some/where comme paramètre, et regarder les résultats. Si l'information est absente ou erronée dans le résultat, c'est un problème de l'agent. Si vous voyez l'information mais que cela n'apparait pas sur le serveur, c'est donc un problème coté serveur.

source: Problem description
fr: Description du problème

source: You have to use english, for sake of internationalization.
fr: Vous devez utiliser l'anglais car c'est un projet international

source: You have to describe your problem clearly and precisely, for someone without any prior knowledge of your environment to understand it. Posting screenshot is not a solution if you're unable to explain it with words.
fr: Vous devez décrire le problème clairement et précisément, pour qu'une personne ne connaissant pas votre système puisse comprendre. Il ne suffit pas de poster une capture d'écran si vous pouvez décrire le problème.

source: Also, the agent is available for different platforms, with different versions, and different installation methods. You have to specify at least the system you're using, and the agent version.
fr: En outre, l'agent est disponible dans différentes plates-formes, avec des versions différentes et des méthodes d'installation différentes. Vous devez spécifier le système que vous utilisez, et la version de l'agent.

source: You can get the agent version and the list of available tasks with these commands:
fr: Vous pouvez obtenir la version de l'agent et la liste des tâches disponibles avec ces commandes:

source: Problem reproductability
fr: Reproductivité du problème

source: That's quite useless to report a problem, if there is no way for the assignee to reproduce it.
fr: Ce n'est pas utile de signaler un problème s'il ne peut pas être reproduit par un développeur.

source: If the problem is related to an erroneous analysis of some system input, the best way is to provide a sample of the information, and the related excerpt of agent output. Identifying the exact system input is usually quite easy to do from reading the agent code.
fr: Si le problème est lié à une analyse erronée d'entrées du système, le meilleur moyen est de donner un échantillon de cette information et un extrait lié à la sortie donnée par l'agent. Identifier l'entrée exacte du système est généralement assez facile à faire à la lecture du code de l'agent.

source: Providing additional content
fr: Donner un contenu supplémentaire

source: If you need to provide additional command output samples, here are a few important rules:
fr: Si vous avez besoin de fournir d'autres échantillons de sortie de commande, voici quelques règles importantes:

source: always attach external files, rather than pasting content, as some invisible formating can be lost
fr: toujours attacher des fichiers externes plutôt que de coller du texte car certains formatage invisible peuvent être perdus.

source: always run command under non-localized environment (`LC_ALL=C` under unix systems)
fr: toujours lancer les commandes dans un environnement non localisé (`LC_ALL=C` sous un système unix)

source: windows WMI queries can be exported with wmic tool (`wmic path <somequery> get /Format:list > <somefile>`)
fr: Les requêtes Windows WMI peuvent être exportées avec l'outil wmic (`wmic path <requête> get /Format:list > <fichier>`)

source: windows registry content can be exported with regedit tool
fr: le contenu du registre windows peut être exporté avec l'outil regedit

source: We may also request a dmidecode output ([[dmidecode On Windows|documentation/agent/bugreport/dmidecode_on_windows]])
fr: Vous pouvez aussi utiliser des requêtes sur la sortie dmidecode ([[dmidecode On Windows|documentation/agent/bugreport/dmidecode_on_windows]])
