Repository: C-Duv/fusioninventory.github.io
Catalog: documentation/agent/configuration.*.po
Languages: fr, pl

source: #Agent configuration
fr: #Configuration de l'agent
pl: #Konfiguracja agenta

source: The agent reads its configuration from a configuration file (from the registry on Windows), then from the command line. Most parameters can be set from any method. For instance, the `server` parameter in configuration file is the same as the `--server` parameter on command line.
fr: L'agent lit la configuration depuis le fichier de configuration (depuis la base de registre sur Windows),

source: Where is the configuration?
fr: Où trouver ce fichier de configuration ?
pl: Gdzie znajduje się konfiguracja?

source: Depending on the OperatingSystem and the installation method, the agent will read its configuration from different places:
fr: En fonction du système d'opération et de la méthode d'installation, l'agent lira la configuration en différent fichier:
pl: W zalezności od systemu operacyjnego i metody instalacji, agent czyta swoją konfiguracje z różnych miejsc:

source: `/etc/fusioninventory/agent.cfg`: default
fr: `/etc/fusioninventory/agent.cfg`: par défaut
pl: `/etc/fusioninventory/agent.cfg`: domyslnie

source: `/opt/fusioninventory/agent.cfg`: MacOSx mpkg
fr: `/opt/fusioninventory/agent.cfg`: agent MacOSx

source: `/usr/local/etc/fusioninventory/agent.cfg`: FreeBSD port
fr: `/usr/local/etc/fusioninventory/agent.cfg`: port FreeBSD

source: `HKEY_LOCAL_MACHINE\SOFTWARE\FusionInventory-Agent`: Windows
fr: `HKEY_LOCAL_MACHINE\SOFTWARE\FusionInventory-Agent`: pour Windows

source: `HKEY_LOCAL_MACHINE\SOFTWARE\Wow6432Node\FusionInventory-Agent`: Windows 64 bits
fr: `HKEY_LOCAL_MACHINE\SOFTWARE\Wow6432Node\FusionInventory-Agent`: pour Windows 64 bits
pl: `HKEY_LOCAL_MACHINE\SOFTWARE\Wow6432Node\FusionInventory-Agent`: Windows 64 bitowy

source: Minimal configuration
fr: Configuration minimale
pl: Minimalna konfiguracja

source: `server`: a server URL, such as http://glpiserver/plugins/fusioninventory/
fr: `server`: URL du serveur, en général, cela ressemble à http://glpiserver/glpi/plugins/fusioninventory/

source: Once this is done, you can [[force an inventory|documentation/agent/launch_the_agent]].
fr: Une fois que cela est fait, vous pouvez [[forcer un inventaire|documentation/agent/launch_the_agent]].
pl: Jeśli powyższe zostanie ustawione możesz [[wymusić inwentaryzacje|documentation/agent/launch_the_agent]].

source: Advanced configuration
fr: Configuration avancée
pl: Zaawansowana konfiguracja

source: All the keys are documented in the OPTIONS section of fusioninventory-agent reference documentation:
fr: Toutes les clés sont documentées dans la section OPTIONS de la documentation de référence de fusioninventory-agent:
pl: Wszystkie klucze są udokumentowane w sekcji OPCJE dokumentacji agenta fusioninventory:

source: [[2.1.x (old stable)|documentation/references/agent/2.1.x/fusioninventory-agent]]
fr: [[2.1.x (ancienne version)|documentation/references/agent/2.1.x/fusioninventory-agent]]
pl: [[2.1.x (stara stabilna)|documentation/references/agent/2.1.x/fusioninventory-agent]]

source: [[2.2.x (stable)|documentation/references/agent/2.2.x/fusioninventory-agent]]
fr: [[2.2.x (version actuelle)|documentation/references/agent/2.2.x/fusioninventory-agent]]
pl: [[2.2.x (stabilna)|documentation/references/agent/2.2.x/fusioninventory-agent]]

source: `server`: the URL to the server, in general, it's http://glpiserver/plugins/fusioninventory/
pl: `server`: adres URL do serwera, zwykle to jest http://glpiserver/plugins/fusioninventory/

source: `debug`: debug can be 0, 1 or 2. We suggest to use 2 to help you understand what append
pl: `debug`: debug może być wartość 0, 1 lub 2. Sugerujemy używać wartości 2 aby zrozumieć co się dzieje

source: `httpd-trust`: it's always a good idea to configure this key with the **IP address** (not the hostname) of the server. This way you will be able to use the **push** mode later.
pl: `httpd-trust`: zawsze jest dobrym pomysłem, aby skonfigurować ten klucz z **adresem IP** (nie nazwą hosta) serwera. To zawsze pozwoli ci później użyć opcji **push**.

source: [[2.3.x (dev)|documentation/references/agent/2.3.x/fusioninventory-agent]]
pl: [[2.3.x (rozwojowa)|documentation/references/agent/2.3.x/fusioninventory-agent]]
