Repository: C-Duv/fusioninventory.github.io
Catalog: documentation/agent/launch_the_agent.*.po
Languages: fr

source: How to force an inventory
fr: Comment forcer un inventaire

source: With the HTTP interface
fr: Avec l'interface HTTP

source: If you agent is running as a service or a daemon, you may be able to access the web interface at <http://localhost:62354>.
fr: Si l'agent fonctionne en mode démon ou service, vous pouvez rendre accessible l'interface web <http://localhost:62354>.

source: If `rpc-trust-localhost` [[configuration key|documentation/agent/configuration]] is true or if `httpd-trust=127.0.0.1`, a link will be available to force the agent execution.
fr: Si la clé `rpc-trust-localhost` est [[configurée key|documentation/agent/configuration]] ou que `httpd-trust=127.0.0.1`, vous pouvez forcer l'exécution de l'agent.

source: Command line
fr: Ligne de commande

source: You can force an inventory with the [[fusioninventory-agent|documentation/references/agent/2.2.x/fusioninventory-agent]] command.
fr: Vous pouvez forcer un inventaire avec la commande [[fusioninventory-agent|documentation/references/agent/2.2.x/fusioninventory-agent]].

source: First, you must open a cmd.exe console. Ensure you started with with *Administrator* privilege (*right clic* → *Run as Administrator* on Vista and Seven *Start menu*).
fr: Premièrement, vous devez ouvrir la console cmd.exe. Assurez vous de ladémarrer avec les droits d'administrateur (*clic droit* → *Exécuter en tant que administrateur* sur Vista et Seven)

source: Go in the **c:\Program files\FusionInventory-Agent\perl\bin** (adjust this path depending on your configuration) directory and run:
fr: Allez dans **c:\Program files\FusionInventory-Agent\perl\bin** (adaptez ce chemin en fonction de votre configuration) et lancez:

source: First, ensure `daemon` key is not defined or false in `agent.cfg`. This key is enabled on MacOSX default settings (`/opt/fusioninventory-agent/agent.cfg`).
fr: En premier, vérifiez que la clé `daemon` n'est pas défini ou à false dans `agent.cfg`. Cette clé est active par défaut sur MacOSX dans le fichier (`/opt/fusioninventory-agent/agent.cfg`).

source: Go in /opt/fusioninventory-agent and run the following command:
fr: Allez dans /opt/fusioninventory-agent et lancez la commande suivante:

source: See [[the MacOSX documentation for further details|documentation/agent/installation/macosx]].
fr: Reportez vous à la page de documentation de MacOSX pour plus de [[détail|documentation/agent/installation/macosx]].

source: Other
fr: Autres

source: Just run:
fr: Simplement lancez:

source: Advanced option
fr: Options avancées

source: You can write a local XML inventory with:
fr: Vous pouvez écrire un inventaire local en XML avec:

source: to generate a HTML file instead, add the `--html` flag:
fr: Pour générer un fichier HTML, ajoutez le paramètre `--html`:

source: Please read [[the fusioninventory-agent reference page|documentation/references]] to get the complet list of supported options.
fr: Veuillez vous reporter à [[la page de référence de fusioninventory-agent|documentation/references]] pour voir la liste compète des options.
