Repository: C-Duv/fusioninventory.github.io
Catalog: documentation/agent/network_less.*.po
Languages: fr

source: FusionInvent without network connection
fr: FusionInventory sans connexion réseau

source: The agent is able to create an file with the inventory:
fr: L'agent est capable de créer un fichier avec l'inventaire:

source: On Windows, you can add the 'local' key in the the registry and associate it with a directory.
fr: Sur windows, vous pouvez ajouter la clé 'local' dans le registre et l'associer avec un dossier.

source: You can get the full documentation of the agent in the [[reference page|documentation/references]].
fr: Vous pouvez trouver la documentation complète de l'agent sur la [[page de référence|documentation/references]].

source: Push my inventories in the server
fr: Intégrer mes inventaires sur le serveur

source: Through FusionInventory for GLPI Interface
fr: Via l'interface FusionInventory pou GLPI

source: Go in *Plugins > FusionInventory > Import agent XML* Menu and upload the XML.
fr: Aller dans *Plugins > FusionInventory > Importer l'agent XML * Menu et uploader le fichier XML.

source: You can get the full documentation of fusioninventoy-injector in the [[reference page|documentation/references]].
fr: Vous trouverez toute la documentation de fusioninventoy-injector sur [[la page référence|documentation/references]].

source: You can also use curl to push an inventory. This can be useful for example if your perl installation has no SSL support and so you can not use the fusioninventory-injector command with a HTTPS only server:
fr: Vous pouvez aussi utiliser curl pour injecter un inventaire. Cela peut vous être utile par exemple si votre installation de Perl n'a pas le support de SSL et que vous ne pouvez utiliser fusioninventory-injector avec un serveur HTTPS:

source: With no SSL check and no authentification :
fr: Sans vérification SSL et sans authentification:
