Repository: C-Duv/fusioninventory.github.io
Catalog: news/2013/02/20/agent_development_process_changes.*.po
Languages: fr

source: Hello all,
fr: Bonjour à tous,

source: Following a meeting between the agent developers, the development process of the agent has been changed a bit. Here are some details.
fr: Suite à une réunion entre les développeurs de *l'agent*, le processus de développement de l'agent a été quelque peu modifié. Voici quelques détails.

source: branches management
fr: Gestion des branches

source: "master" is now the stable branch, receiving only trivial bugfixes and new validated new features. This branch has to stable enough to alow regular new releases.
fr: "master" est maintenant la branche stable, recevant seulement les corrections de bug basiques et les nouvelles fonctionnalités dernièrement validées. Cette branche restera stable pour permettre la sortie régulière des nouvelles versions.

source: New features have to be prepared in dedicated development branches, with a name following "\<branch\>+\<feature\>" pattern. It will be merged in master branch as soon as the feature is validated.
fr: Les nouvelles fonctionnalités doivent être préparés dans des branches de développement dédiés, avec une règle de nom suivante "\<branch\>+\<feature\>". Elles seront fusionnées dans la branche *master* dès que les fonctions seront validées.

source: For example, to develop a new task dedicated to coffee machines inventory:
fr: Par exemple, pour développer une nouvelle tâche dédiée aux inventaires des machines à café:

source: a new development branch called master+add_coffee_maker_inventory is created
fr: une nouvelle branche nommée *master+add_coffee_maker_inventory* sera créée

source: the new task is created, with adequate unit testing
fr: La nouvelle tâche est créée avec le *test unit* adéquat

source: the new task is validated
fr: La nouvelle tâche est validée

source: the development branch get merged in the master branch
fr: La branche de développement est fusionnées avec la branche principale (*master*)

source: Bug fix branch will be created when needed, (e.g, 2.3.x) to prepare fix-only releases. For example, 2.3.x will be created the day we need to release a 2.3.1 release to fix 2.3.0.
fr: La branche de correction de bug pourra être créée au besoin (ex: 2.3.x) pour préparer seulement les correctifs de version. Par exemple, 2.3.x sera créée le jour où nous sortirons la version 2.3.1 pour corriger la 2.3.0.

source: branches renaming
fr: renommage des branches:

source: "2.3.x" is now "master"
fr: "2.3.x" devient "master"

source: "master" is now "master+restjson"
fr: "master" devient "master+restjson"

source: "2.3.x+foo" are now "master+foo"
fr: "2.3.x+foo" devient "master+foo"

source: Some old branches have been renamed with a new "attic/" prefix.
fr: Quelques anciennes branches ont été renommées avec un nouveau préfixe "attic/"

source: Additional tasks integration
fr: Intégration de tâches additionnelles

source: Additional agent tasks (network discovery, network inventory, ESX inventory and software deployement) developed and distributed separatly will be integrated into the agent repository, and the corresponding forge projects will be closed.
fr: Les tâches additionnelles de l'agent (découverte réseau, inventaire réseau, inventaire ESX et déploiement de logiciel) développées et distribuées séparément seront intégrées dans le répertoire de l'agent, et les projets Forge correspondants seront fermés.

source: 2.3.0 release
fr: version 2.3.0

source: The 2.3.0 release is mostly ready. We have to work on the Windows installer to finish what Tomás Abad started some weeks ago.
fr: La version 2.3.0 est presque prête. Nous travaillons à terminer le programme d'installation pour Windows, c'est ce que Tomás Abad a commencé, il y a quelques semaines.
