Repository: C-Duv/fusioninventory.github.io
Catalog: news/2014/02/27/FusionInventory_plugin_for_GLPI_0.84+2.1.*.po
Languages: fr

source: FusionInventory plugin for GLPI 0.84+2.1
fr: Plugin FusionInventory For GLPI 0.84+2.1

source: The Fusioninventory plugin for GLPI 0.84+2.1 has been released and it comes with the following changes:
fr: Le plugin FusionInventory For GLPI 0.84+2.1 vient d'être publié et il apporte les changements suivants :

source: Massive actions added on "ignored devices" list.
fr: Les actions de masse sont ajoutées pour la liste "matériels ignorés".

source: Static groups have been reactivated in code.
fr: Les groupes statiques ont été réactivés dans le code.

source: Use blacklist for monitors attached to computers.
fr: Utilisation de liste noire pour les écrans liés aux ordinateur.

source: SNMP inventory without XML models.
fr: Inventaire SNMP sans modèles XML.

source: Import of aggregated ports on network switches.
fr: Import des ports agrégés sur les switches réseaux.

source: - Inventory: - Massive actions in computers list to target a Deploy task was broken. - Fixed a lot of monitors inventory related issues. - Fixed some Lock fields issue. - The imported sofwares are set to recursive if they are assigned to a parent entity relative to the entity of the computer. - Fixed IP addresses that were not correctly imported. - Deploy: - The Deploy repository cleanup script has been fixed and updated to take the new 0.84 repository structure. - Fixed Deploy json structure inconsistencies. - Fixed some communication issues with the agent. - Tasks: - Restored multiple jobs in tasks configuration. - Fixed issue with VMWare inventory tasks. - Installation: - Fixed some previous update regressions. - Rules engine: - Fixed some import rules related issues.
fr: - Inventaire: - Actions de masses pour la liste des ordinateurs ciblés pour un déploiement ayant échoués. - Correctif pour les problèmes d'inventaire de nombreux d'écran. - Correctif pour des problèmes de champs verrouillés. - L'import des logiciels est paramétré récursivement si ils sont assignés à une entité parent relativement à l'entité de l'ordinateur. - Correctif pour les adresses IP importées incorrectement. - Déploiement: - Le script de nettoyage du dossier de déploiement a été corrigé et mis à jour pour prendre la nouvelle structure de dossier pour la 0.84. - Correctif pour les incohérences de la structure json de déploiement. - Correctif pour plusieurs problèmes de communication avec l'agent. - Tâches: - Remise en service de la gestion multiple de jobs dans la configuration des tâches. - Correctif pour le problème avec les tâches d'inventaire VMWare. - Installation: - Correctif pour plusieurs régressions de mises à jour précédentes. - Moteur de Règles: - Correctif pour plusieurs problèmes de règles d'import.

source: For those who updated from **0.83** to **0.84+1.0**, there has been some missing code issue that led to a broken Deploy repository.
fr: Pour ceux qui on fait la mise à jour de **0.83** à **0.84+1.0**, il y a eu plusieurs problèmes de code absent qui a conduit à détériorer le référentiel Déploiement.

source: Now, you can fix and recover your repository by injecting the following two tables from a **0.83+x.x** backup of your databases :
fr: Maintenant, vous pouvez corriger et restaurer votre référentiel en injectant les deux tables suivantes depuis la sauvegarde de votre base de donnée **0.83+x.x** :

source: You can download this release from the following address: <http://forge.fusioninventory.org/attachments/download/1281/fusioninventory-for-glpi_0.84+2.1.tar.gz>
fr: Vous pouvez télécharger cette nouvelle version avec l'adresse suivante :<http://forge.fusioninventory.org/attachments/download/1281/fusioninventory-for-glpi_0.84+2.1.tar.gz>

source: Make sure to backup your previous installation (files and database) before upgrading.
fr: Assurez vous de bien avoir sauvegarder votre installation (fichiers et base de donnée) avant de mettre à jour.
