Repository: C-Duv/fusioninventory.github.io
Catalog: news/2013/08/14/Plugin_FusionInventory_for_GLPI_0.84_1.0_*_available.*.po
Languages: fr

source: Some days ago the [GLPI Project](http://www.glpi-project.org/) has released a new major release of GLPI. We want to congratulate the GLPI team :)
fr: Depuis quelques jours l'équipe [GLPI Project](http://www.glpi-project.org/) a diffusée la nouvelle version de GLPI. Nous voulons les féliciter. :)

source: It's a real pleasure to announce the release of plugin FusionInventory for GLPI 0.84+1.0 designed for this new GLPI version.
fr: C'est avec un réel plaisir que nous annonçons la nouvelle version du plugin FusionInventory For GLPI 0.84+1.0 conçue pour la nouvelle version de GLPI.

source: major changes
fr: Changements majeurs :

source: Aggregation of different fus* plugins into unique plugin named 'FusionInventory'
fr: Regroupement des différents plugins fus* dans un seul plugin nommé 'FusionInventory'

source: Rewrite inventory engine, remove cache, enhance performance (from 150% to more than 1000%)
fr: Réécriture du moteur d'inventaire, suppression du cache, amélioration de la performance (de 150% à plus de 1000%)

source: reorder menu of plugin (in Plugins > FusionInventory)
fr: Ré-aménagement du menu du plugin (dans Plugins > FusionInventory)

source: Use GLPI configuration field 'Entity for software creation'
fr: Utilisation des champs de configuration GLPI 'Entity for software creation'

source: Use GLPI 'is_dynamic' system, permit to display if a field/component/volume/... is from automatic inventory or managed manually
fr: Utilisation du système GLPI 'is_dynamic', permet d'afficher si un champ/ composant/volume/... vient d'un inventaire automatique ou manuel

source: Display archname for windows (works only with agent 2.3 minimum)
fr: Affichage du nom d'architecture pour Windows (valable uniquement avec l'agent 2.3 minimum)

source: Add option to create computer from VM information from host inventory
fr: Ajout de l'option permettant de créer un PC depuis les informations d'une VM venant d'inventaire machine

source: Display switch ports in GLPI Core 'network ports' tab and add possibility to switch to GLPI Core view
fr: Affichage des ports du switch dans l'onglet GLPI 'network ports' et ajout possible dans la vue du switch dans GLPI

source: Add % of cartridge when create a SNMPmodel (with community tool)
fr: Ajout du % de la cartouche lors de la création d'un modèle SNMP (avec l'outil communautaire)

source: Page counter graph use now nvd3, powerfull graphs
fr: Le graphique de la page compteur utilise maintenant nvd3, pour de meilleur graphiques

source: New dynamic groups for deploy system based on GLPI search engine
fr: Nouveaux groupes dynamiques pour le système de déploiement basés sur le moteur de recherche GLPI

source: Add location link for mirrors (Deploy)
fr: Ajout de lien pour localiser les miroirs (Déploiement)

source: Add a new rule type : location
fr: Ajout de nouvelle règle type : Location

source: Bug fixes
fr: Corrections de Bug :

source: This release also come with the usual fixes and improvements.
fr: Cette version sort avec les dernières corrections de bug et améliorations.

source: [See the changelog for further information.](http://forge.fusioninventory.org/versions/68)
fr: [Reportez vous à la liste des modifications pour plus d'information.](http://forge.fusioninventory.org/versions/68)

source: Download
fr: Téléchargement

source: The archive is available in the [Download page of the forge](http://forge.fusioninventory.org/projects/fusioninventory-for-glpi/files)
fr: L'archive est disponible sur [la page de téléchargement de la Forge](http://forge.fusioninventory.org/projects/fusioninventory-for-glpi/files)

source: Bug hunting contest result:
fr: Résultat du concours de la 'Chasse aux Bug' :

source: (ex aequo): Arnaud Meurou and Romain Ingrand (11 bugs)
fr: (ex æquo): Arnaud Meurou et Romain Ingrand (11 bugs)

source: So we will send a Rapsberry pi to Tomas ;) Thanks to all of you who reported bugs for the release!
fr: Donc nous enverrons un Rapsberry pi à Tomas ;) . Merci à tous ceux qui ont rapporté les bugs pour cette version !

source: We want to take the opportunity of this news to thanks Tomás Abad who dedicated a lot of his time to the FusionInventory project. You rocks!
fr: Nous profitons de cet article pour remercier Tomás Abad qui a pris beaucoup de son temps pour le projet FusionInventory. You rocks!
