Repository: C-Duv/fusioninventory.github.io
Catalog: news/2011/09/13/First_release_for_FusionInventory_Agent_for_Android.*.po
Languages: fr

source: The FusionInventory team is proud to announce the support of a new platform: Android. <h1>FusionInventory Agent for Android 1.0.1 is out!</h1>
fr: L'équipe de FusionInventory est fière 'annoncer le support d'une nouvelle plate-forme : Android. <h1>L'Agent FusionInventory pour Android 1.0.1 est là !! </h1>

source: Download<a href="/news/2011/09/13/fusioninventory-for-android-1.0.png"><img class="alignright size-full wp-image-1205" title="fusioninventory-for-android-1.0" src="/news/2011/09/13/fusioninventory-androidmarket.png" alt="" width="235" height="235" /></a>
fr: href="/news/2011/09/13/fusioninventory-for-android-1.0.png"><img class="alignright size-full wp-image-1205" title="fusioninventory-for-android-1.0" src="/news/2011/09/13/fusioninventory-androidmarket.png" alt="" width="235" height="235" /></a>

source: FusionInventory Agent for Android 1.0.1 is available on the market.
fr: l' Agent FusionInventory pour Android 1.0.1 est disponible sur le «Market».

source: You can also download the agent at following URLs (or use the QR code):
fr: Vous pouvez aussi télécharger l'agent suivant ces liens (ou via le QR code):

source: New
fr: Nouveauté

source: This agent is a very special one. It has been written from scratch for the Android platform, with the support of following people and organizations: Kévin Roy, Sébastien Lacroix and Walid Nouh, [TECLIB'](http://www.teclib.com/) and [Mandriva](http://www.mandriva.com/). A reasonable mix of community involvment and company support. Thank you all!
fr: Cet agent est une version très spéciale. Il a été écrit à partir de zéro pour la plate-forme Android, avec l'aide des personnes et organisations suivantes : Kévin Roy, Sébastien Lacroix et Walid Nouh, [TECLIB'](http://www.teclib.com/) et [Mandriva](http://www.mandriva.com/). Un bon exemple de mélange entre la communauté et l'implication des entreprises. Merci à tous!

source: Inventory
fr: Inventaire

source: It features a complete inventory of your Android devices: both hardware and software informations are collected. You get the data about processor, memory, drives, sensors, etc. and also the list and description of installed application (apk).
fr: Il effectue un inventaire complet de vos appareils Android: les informations matérielles et logicielles sont collectées. Vous obtenez les données sur processeur, la mémoire, les disques, les capteurs, etc ainsi que la liste et la description des applications installées (apk)

source: Supported<a href="/news/2011/09/13/android_logo.gif"><img class="alignright size-thumbnail wp-image-1203" title="android_logo" src="/news/2011/09/13/android_logo-150x150.gif" alt="Android Logo" width="90" height="90" /></a>
fr: Opérationnel<a href="/news/2011/09/13/android_logo.gif"><img class="alignright size-thumbnail wp-image-1203" title="android_logo" src="/news/2011/09/13/android_logo-150x150.gif" alt="Android Logo" width="90" height="90" /></a>

source: FusionInventory Agent for Android is running on Android 1.6 and higher. We maintain a [list of tested devices](http://forge.fusioninventory.org/projects/fusioninventory/wiki/Smartphone_Compatibility). Please report any success or failure on [the bug tracker](http://forge.fusioninventory.org/projects/android/issues/new). Some informations (for example serial number) won't be available on devices running Android 2.2 or lower. If you know how to collect them, please open request on the bug tracker.
fr: FusionInventory Agent pour Android fonctionne sur Android 1.6 et supérieur. Nous maintenons une [liste des appareils testés](http://forge.fusioninventory.org/projects/fusioninventory/wiki/Smartphone_Compatibility). S'il vous plaît, signalez toute réussite ou échec sur le [bug tracker](http://forge.fusioninventory.org/projects/android/issues/new). Quelques informations (par exemple le numéro de série) ne seront pas disponibles sur les appareils fonctionnant sous Android 2.2 ou inférieur. Si vous savez comment les recueillir, s'il vous plaît, ouvrez demande sur le bug tracker.

source: Connect
fr: Usage

source: FusionInventory Agent for Android can send inventory to: FusionInventory for GLPI 2.3.x and higher, OCS Inventory 1.3.x and 2.x (for the last one you need to [apply a patch](http://forge.fusioninventory.org/projects/fusioninventory-agent/wiki/Patch_ocs_server)). <table> <tbody> <tr> <td> <a href="/news/2011/09/13/fusioninventory-agent-android-interface4.png"><img class="size-medium wp-image-1238 aligncenter" title="fusioninventory-agent-android-interface4" src="/news/2011/09/13/fusioninventory-agent-android-interface4-180x300.png" alt="" width="180" height="300" /></a></td> <td><a href="/news/2011/09/13/fusioninventory-agent-android-interface3.png"><img class="size-medium wp-image-1237 aligncenter" title="fusioninventory-agent-android-interface3" src="/news/2011/09/13/fusioninventory-agent-android-interface3-180x300.png" alt="" width="180" height="300" /></a></td> <td><a href="/news/2011/09/13/fusioninventory-agent-android-interface2.png"><img class="size-thumbnail wp-image-1236 aligncenter" title="fusioninventory-agent-android-interface2" src="/news/2011/09/13/fusioninventory-agent-android-interface2-150x150.png" alt="" width="150" height="150" /></a></td> </tr> <tr> <td><a href="/news/2011/09/13/fusioninventory-agent-android-interface1.png"><img class="size-thumbnail wp-image-1235 aligncenter" title="fusioninventory-agent-android-interface1" src="/news/2011/09/13/fusioninventory-agent-android-interface1-150x150.png" alt="" width="150" height="150" /></a></td> <td><a href="/news/2011/09/13/software.png"><img class="aligncenter size-medium wp-image-1185" title="software" src="/news/2011/09/13/software-300x81.png" alt="" width="300" height="81" /></a></td> <td><a href="/news/2011/09/13/serial.png"><img class="aligncenter size-medium wp-image-1184" title="serial" src="/news/2011/09/13/serial-300x65.png" alt="" width="300" height="65" /></a></td> </tr> </tbody> </table>
fr: FusionInventory Agent pour Android peut envoyer un inventaire a : FusionInventory for GLPI 2.3.x et supérieur, OCS Inventory 1.3.x and 2.x (pour ce dernier vous devez [appliquer ce correctif](http://forge.fusioninventory.org/projects/fusioninventory-agent/wiki/Patch_ocs_server)). <table> <tbody> <tr> <td> <a href="/news/2011/09/13/fusioninventory-agent-android-interface4.png"><img class="size-medium wp-image-1238 aligncenter" title="fusioninventory-agent-android-interface4" src="/news/2011/09/13/fusioninventory-agent-android-interface4-180x300.png" alt="" width="180" height="300" /></a></td> <td><a href="/news/2011/09/13/fusioninventory-agent-android-interface3.png"><img class="size-medium wp-image-1237 aligncenter" title="fusioninventory-agent-android-interface3" src="/news/2011/09/13/fusioninventory-agent-android-interface3-180x300.png" alt="" width="180" height="300" /></a></td> <td><a href="/news/2011/09/13/fusioninventory-agent-android-interface2.png"><img class="size-thumbnail wp-image-1236 aligncenter" title="fusioninventory-agent-android-interface2" src="/news/2011/09/13/fusioninventory-agent-android-interface2-150x150.png" alt="" width="150" height="150" /></a></td> </tr> <tr> <td><a href="/news/2011/09/13/fusioninventory-agent-android-interface1.png"><img class="size-thumbnail wp-image-1235 aligncenter" title="fusioninventory-agent-android-interface1" src="/news/2011/09/13/fusioninventory-agent-android-interface1-150x150.png" alt="" width="150" height="150" /></a></td> <td><a href="/news/2011/09/13/software.png"><img class="aligncenter size-medium wp-image-1185" title="software" src="/news/2011/09/13/software-300x81.png" alt="" width="300" height="81" /></a></td> <td><a href="/news/2011/09/13/serial.png"><img class="aligncenter size-medium wp-image-1184" title="serial" src="/news/2011/09/13/serial-300x65.png" alt="" width="300" height="65" /></a></td> </tr> </tbody> </table>
