Repository: C-Duv/fusioninventory.github.io
Catalog: documentation/agent/installation/linux/deb.*.po
Languages: fr, pl

source: Using FusionInventory Debian (and Ubuntu) packages
fr: Utiliser les paquets Debian (et Ubuntu) de FusionInventory
pl: Używanie paczek FusionInventory dla Debian (i Ubuntu)

source: Installation with the debian packages
fr: Installation avec les paquets Debian (.deb)
pl: Instalacja z paczek debiana

source: FusionInventory Agent is also available in Debian Backports repository
fr: L'agent FusionInventory est seulement disponible dans les dépôts Backports Debian
pl: Agent FusionInventory jest także dostępny w repozytorium Debian Backports

source: FusionInventory own repository
fr: Notre dépôt pour FusionInventory
pl: Własne repozytorium FusionInventory

source: The FusionInventory project maintains an up-to-date debian package of the most recent version, in a extra repository.
fr: Le projet FusionInventory maintient à jour un dépôt spécial pour les dernières versions des paquets Debian.
pl: Projekt FusionInventory utrzymuje aktualne paczki debiana w dodatkowym repozytorium.

source: The content of the [dists](http://debian.fusioninventory.org/debian/dists/) pages can help you do identify support operating system.
fr: Le contenu de cette [page](http://debian.fusioninventory.org/debian/dists/) vous aidera à identifier les versions des systèmes d'opérations supportés.
pl: Na stronie spisu [dystrybucji](http://debian.fusioninventory.org/debian/dists/) jest aktualna lista wspieranych systemów operacyjnych.

source: Install the additional packages
fr: Installation des paquets additionnels Debian (.deb)
pl: Instalacja dodatkowych paczek

source: Network inventory tasks:
fr: Tâches d'inventaire réseau
pl: Zadania inwentaryzacji sieci:

source: ESX inventory task:
fr: Tâche d'inventaire des ESX
pl: zadanie inwentaryzacji ESX:

source: Deploy task:
fr: Tâche de déploiement
pl: Zadania zdalnej instalacji:
