Repository: C-Duv/fusioninventory.github.io
Catalog: documentation/agent/installation/linux/fedora.*.po
Languages: fr

source: Installation of the Agent on Fedora
fr: Installation de l'agent pour Fedora

source: Maintained Fedora version
fr: Version maintenue pour Fedora

source: *fusioninventory-agent* is part of the *official repository* for fedora >= 14
fr: *fusioninventory-agent* fait parti du *dépôt officiel* pour Fedora >= 14

source: EOL Fedora version
fr: Version EOL de Fedora

source: An old *fusioninventory-agent* package is available in the *remi* third party repository for for fedora >= 8
fr: Un vieux paquet *fusioninventory-agent* est disponible dans le dépôt de *remi* pour Fedora >= 8

source: See [Remi repository configuration](http://blog.famillecollet.com/pages/Config-en) for details.
fr: Reportez vous à [Remi repository configuration](http://blog.famillecollet.com/pages/Config-en) pour plus de details.

source: Agent installation
fr: Installation de l'agent

source: Agent installation:
fr: Installation de l'agent

source: Only *fusioninventory-agent* is mandatory, other packages are additional tasks.
fr: Seul *fusioninventory-agent* est obligatoire, les autres paquets sont pour les tâches additionnels.

source: You can also install the *yum plugin* which will request a inventory after each yum operation
fr: Vous pouvez aussi installer le *plugin yum* qui lancera un inventaire après chaque action de yum.
