Repository: C-Duv/fusioninventory.github.io
Catalog: documentation/references/agent-task-esx/2.x/fusioninventory-esx.*.po
Languages: fr

source: NAME
fr: NOM

source: fusioninventory-esx - vCenter/ESX/ESXi remote inventory from command line
fr: FusionInventory-esx - vCenter/ESX/ESXi inventaire à distance à partir d'une ligne de commande

source: Options: --help this menu --host hostname ESX server hostname --user username user name --password xxxx user password --directory directory output directory --tag tag tag for the inventoried machine
fr: Options: --help Ce Menu --host hostname ESX nom de domaine du serveur --user username nom d'utilisateur --password xxxx mot de passe utilisateur --directory directory répertoire de sortie --tag tag balise pour la machine inventoriée

source: EXAMPLES
fr: EXEMPLES

source: You can import the .ocs file in your inventory server with the fusioninventory-injector tool. %fusioninventory-injector -v --file /tmp/\*.ocs -u https://myserver/ocsinventory
fr: Vous pouvez importer le fichier .ocs dans votre serveur d'inventaire avec l' outil fusioninventory-injector. %fusioninventory-injector -v --file /tmp/\*.ocs -u https://myserver/ocsinventory

source: `fusioninventory-esx` creates inventory of remote ESX/ESXi and vCenter VMware. It uses the SOAP interface of the remote server.
fr: `fusioninventory-esx` créé des inventaires à distance ESX/ESXi et vCenter VMware. Il utilise l'interface SOAP du serveur distant.

source: Supported systems:
fr: Systèmes supportés

source: Active Directory users, please note the AD authentication doesn't work. You must create a account on the VMware server.
fr: Utilisateurs d' Active Directory, merci de notez que l'authentification AD ne fonctionne pas. Vousdevez créer un compte sur le serveur VMware.

source: LIMITATION
fr: LIMITES

source: So far, ESX serial number are not collected.
fr: Jusqu'à présent, les numéros de série ESX ne sont pas recueillis.

source: SECURITY
fr: SÉCURITÉ

source: The SSL hostname check of the server is disabled.
fr: Le nom de domaine SSL vérifie si le serveur est désactivé.
