Repository: C-Duv/fusioninventory.github.io
Catalog: documentation/faq.*.po
Languages: fr

source: Tasks are not enabled
fr: les Tâches ne sont pas activées

source: These messages show up in the agent log when the server do not ask for an Network Discovery or a Network Inventory.
fr: Ces messages apparaissent dans le journal de l'agent lorsque le serveur ne demande pas de découverte du réseau ou d'inventaire de réseau.

source: How to redirect OCS agent with Apache
fr: Comment rediriger l'agent OCS avec Apache

source: You can use an [alias](http://httpd.apache.org/docs/2.2/mod/mod_alias.html) directive to redirect traffic from /ocsinventory to FusionInventory.
fr: Vous pouvez utiliser un [alias](http://httpd.apache.org/docs/2.2/mod/mod_alias.html) qui redirigera le trafic de /ocsinventory vers FusionInventory.

source: Take care to declare this directive before an `Alias / XXX` or it will be ignored.
fr: Prenez soin de déclarer cette directive avant un `Alias / XXX` ou il sera ignoré

source: For example:
fr: Par exemple:

source: It's also possible to use a regular expression for that.
fr: Il est également possible d'utiliser une expression régulière pour ça.

source: I get *Unable to find agent to run this job* message
fr: Je reçois comme message * Unable to find agent to run this job *

source: You will get *Unable to find agent to run this job* message when the server can't find an agent to run a task in push mode:
fr: Vous obtiendrez * Unable to find agent to run this job * lorsque le serveur ne peut pas trouver un agent pour exécuter une tâche en mode push:

source: Ensure an agent is running as service or daemon
fr: S'assurer que l'agent est lancé comme un service ou un démon

source: The server can contact http://$agentIP:62354 directly
fr: Le serveur peut contacter directement: http://$agentIP:62354

source: Check in http://glpi/plugins/fusioninventory/front/agent.php if the agent has *Network discovery* and *Network inventory (SNMP)* modules turned on
fr: Vérifiez dans http://glpi/plugins/fusioninventory/front/agent.php si les agents *Découverte réseau* et *Inventaire réseau (SNMP)* sont activés

source: On which platforms is the FusionInventory agent available?
fr: Sur quelles plateformes l'agent FusionInventory est disponible?

source: The agent is available on Windows, MacOS X, Linux, FreeBSD, OpenBSD, NetBSD, DragonFlyBSD, AIX, Solaris, HP-UX. The agent shares the same codebase on all these platforms.
fr: L'agent est disponible sur Windows, MacOS X, Linux, FreeBSD, OpenBSD, NetBSD, DragonFlyBSD, AIX, Solaris, HP-UX. L'agent partage le même cœur du code sur toute ces plateformes.

source: An agent for Android is also available on [Google Play](https://play.google.com/store/apps/details?id=org.fusioninventory).
fr: Un agent est également disponible pour Android sur [Google Play](https://play.google.com/store/apps/details?id=org.fusioninventory).

source: How can I configure two or more servers
fr: Comment puis-je configurer un ou plusieurs serveurs

source: In the agent configuration file, you can define several servers to communicate with. For example to communicate with three servers: FusionInventory Server for GLPI 0.80 and 0.83, and OCSInventory server:
fr: Dans le fichier de configuration de l'agent, vous pouvez définir plusieurs serveurs pour communiquer avec. Par exemple pour communiquer avec trois serveurs : FusionInventory Serveur pour GLPI 0.80 et 0.83, et OCSInventory serveur:

source: server=http://glpi080/plugins/fusioninventory/front/plugin_fusioninventory.communication.php, http://glpi083/plugins/fusioninventory/, http://ocsinventory-ng/ocsinventory The agent will contact each server in the order defined in the configuration file, and perform the actions requested from each of them.
fr: server=http://glpi080/plugins/fusioninventory/front/plugin_fusioninventory.communication.php, http://glpi083/plugins/fusioninventory/, http://ocsinventory-ng/ocsinventory L'agent communiquera avec chaque serveur dans l'ordre défini dans le fichier de configuration, et effectuera les actions demandées à chacun d'eux.

source: Is FusionInventory agent compatible with OCS Inventory NG Server?
fr: Est ce que l'agent FusionInventory est compatible avec OCS Inventory NG Serveur?

source: Yes, your server will need to be configured to accept the Fusioninventory UserAgent in the ocsinventory-server.conf
fr: Oui, votre serveur doit être configuré pour accepter l'agent fusioninventory dans l'ocsinventory-server.conf

source: Please note that FusionInventory-Agent doesn’t support OCS’s IP Discover feature, and that OCS Deployment module is now deprecated and will not be developped anymore.
fr: Veuillez noter que l'agent FusionInventory ne supporte pas la découverte IP d'OCS, mais aussi que l’outil de déploiement d'OCS est obsolète est ne sera pas plus développé

source: If you’re looking for a software deployment solution, FusionInventory provides it’s own, which is integrated into GLPI.
fr: Si vous êtes à la recherche d'une solution de déploiement logiciel, FusionInventory fourni son propre outil, qui est intégré dans GLPI.

source: My agent refuses to start a job with the "Bad token" error
fr: Mon agent refuse de démarrer la tâche avec comme erreur "Bad token"

source: “Bad token” problems means the agent and the server are not synchronized anymore. You can resolve the situation either:
fr: Le message “Bad token” signifie que l'agent et le serveur ne sont pas synchronisés Vous pouvez résoudre la situation en faisant :

source: just by running an inventory
fr: En exécutant un inventaire

source: by using `httpd-trust` parameter to allow request from the server IP.
fr: en utilisant le paramètre `httpd-trust` qui autorisera l'IP du serveur.

source: [[!template id=warning text="A bug fixed in 2.2.7 prevent the use of `rpc-trust-localhost` and `httpd-trust`."]]
fr: [[!template id=warning text="Un bug a été fixé dans la 2.2.7 pour empêcher l'utilisation de `rpc-trust-localhost` et `httpd-trust` simultanément."]]

source: I get a duplicated computer, what appends?
fr: Je reçois un ordinateur dupliqué, qu'est ce qui s'ajoute ?

source: With the default settings, FusionInventory for GLPI use the follow criteria to identify computer:
fr: Avec les paramètres par défaut, *FusionInventory for GLPI* utilisera ces critères pour identifier la machine :

source: MAC addresses
fr: Adresses Matérielles (adresses MAC)

source: serial number
fr: Numéro de Série

source: One of this information is probably duplicated.
fr: Une de ces informations est probablement dupliquée.

source: Can I use a mastering software like Ghost to deploy my agent
fr: Puis-je utiliser un gestionnaire d'image système comme Ghost pour déployer mon agent

source: Yes you can as soon as to clean up the 'var' directory just before the master creation.
fr: Oui, mais vous devez nettoyer le répertoire 'var', juste avant la création de l'image source.

source: How can I inventory my VMware Workstation virtual machines
fr: Comment inventorier mes machines virtuelles VMware Workstation

source: VMware Workstation is only supported on Linux and MacOSX. You can will probably need the _scan-homedirs_ parameter. This way, the agent will look for Virtual machine in user directories.
fr: VMware Workstation est seulement possible sur Linux et MacOSX. Vous aurez probablement besoin du paramètre _scan-homedirs_. Comme cela, l'agent pourra voir les machines virtuelles dans les dossiers des utilisateurs.
