Repository: C-Duv/fusioninventory.github.io
Catalog: documentation/translation.*.po
Languages: fr

source: How to translate FusionInventory
fr: Comment Traduire FusionInventory

source: FusionInventory for GLPI can be translated directly on Transifex. You will need an account: <https://www.transifex.com/projects/p/FusionInventory/>
fr: *FusionInventory For GLPI* peut être directement traduit sur Transifex. Il vous faudra créer un compte: https://www.transifex.com/projects/p/FusionInventory/

source: You can translate the website directly with a browser. It's also possible to work on [[your own copy of the website|documentation/wiki]]. You will just need a [Git client](http://git-scm.com/) to retrieve a copy of the website. For your information, [Lokalize](http://userbase.kde.org/Lokalize) is a great tool to translate the .po files.
fr: Vous pouvez traduire directement depuis le site web avec votre navigateur. Il est également possible de travailler sur [[votre copie du site|documentation/wiki]]. Vous avez besoin d'un client [Git](http://git-scm.com/) pour avoir une copie du site. Pour information,[Lokalize](http://userbase.kde.org/Lokalize) est un bon outil pour traduire les fichiers .po .

source: If you want us to enable another langage, please contact [Gonéri](mailto:goneri@rulezlan.org) or the [[Translator mailing list|resources]].
fr: Si vous désirez utiliser une autre langue, s'il vous plait contactez Gonéri 'goneri@rulezlan.org' ou la [[liste de diffusion des traducteurs |resources]].

source: Glossary for translators
fr: Glossaire pour les traducteurs

source: Here you will find technical words to be translated or not. Register on the [Mailing list for translators](http://lists.alioth.debian.org/mailman/listinfo/fusioninventory-i18ni)
fr: Vous trouverez ici les mots techniques qui doivent ou non être traduit. Enregistrez vous sur la [liste de diffusion des traducteurs](http://lists.alioth.debian.org/mailman/listinfo/fusioninventory-i18ni) pour discuter des choix de traductions.

source: FusionInventory For GLPI :
fr: FusionInventory For GLPI : Il faut laisser *FusionInventory For GLPI* car cela désigne le nom du plugin pour GLPI.

source: Plugin :
fr: Plugin : ce mot ne doit pas être traduit car il est utilisé comme tel sous différents documents ou ressources de FusionInventory ou GLPI.

source: peer to peer :
fr: peer to peer : il faut traduire ce terme par p2p

source: Bug :
fr: Bug : doit rester en anglais pour être en cohérence avec le gestionnaire de bug (bugtracker)

source: prebuilt :
fr: prebuilt : il faut laisser prebuilt pour bien différencier les exécutables ou paquets de distribution de ces versions *prebuilt* faites pour des cas de tests ou debug.

source: Backend :
fr: Backend : à laisser en version anglaise

source: Benchmark :
fr: Benchmark : terme difficilement traduisible

source: net :
fr: net : ne pas traduire

source: ip :
fr: ip : ne pas traduire
